{"reviewerID": "A2VS9AKSIA487A", "asin": "B003BEDPHM", "reviewerName": "Amazon Customer \"hughster\"", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I've never used a mouse I've totally loved, but this is as good as any I've had.It would be worth full price, and if you don't mind an odd color,  you may be able to get it for less, I got a red for under $10.Smooth operation, very quiet. Middle button (pushing down on scroll wheel) is a little hard to push, might be an issue for someone who uses that a lot- I don't. Left/right buttons seem a little cheesy, but no problems noted.Got two, one for work and one for home, so I don't have to get used to different mouses (yes, mice)Be sure to download drivers from MS, easy to find, for full operation.", "overall": 4.0, "summary": "As good as any mouse I've had", "unixReviewTime": 1381104000, "reviewTime": "10 7, 2013"}
{"reviewerID": "A1ZPFWVG7DN0SZ", "asin": "B003BEDPHM", "reviewerName": "Ander", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I was looking forward to this, as it's the model Microsoft currently makes that most resembles my beloved and discontinued Comfort Mouse 3000.I've used many mice with extra side buttons, and have never had any problems. On this model, I was baffled to find that Microsoft decided to move the side buttons up to virtually the same positions where your fingertips hold the mouse. I'm a reasonably dextrous person&#8212;I play several musical instruments, and am a fast typist&#8212;but I could NOT use this mouse without regularly and unintentionally pressing the side buttons. What could be more distracting than clicking things you didn't mean to, or having the context menu pop up unbidden?A disappointment. If you're considering this mouse, be sure to find one you can try first.", "overall": 2.0, "summary": "What were they thinking?", "unixReviewTime": 1396137600, "reviewTime": "03 30, 2014"}
{"reviewerID": "A2WC1IUVO1EYSN", "asin": "B003BEDPHM", "reviewerName": "asaens", "helpful": [1, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "don't like the feel and the side buttons are on the sensitive side ... the wheel doesn't work like some of the others I've had.  Looks good on the screen but just wasn't the mouse for me.  I wouldn't buy another regardless of the price.", "overall": 2.0, "summary": "Would return it if purchased locally ...", "unixReviewTime": 1377216000, "reviewTime": "08 23, 2013"}
{"reviewerID": "A1Q7PWL1KU6F7K", "asin": "B003BEDPHM", "reviewerName": "Elisbet Y.", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I do like this mouse. The scroll-wheel aspect that others have mentioned, the &#34;smooth-scroll&#34; feature, is pretty obnoxious. Forget art/photo editing, and gaming takes quite an adjustment. The buttons on either side are way too easy too click, but you adjust.That said, it feels nice with a slightly-rubberized grip (the black section), and is a great size for my hand (large-ish for a woman, but smaller than most men). The color is a NICE pale pink (not too &#34;Barbie&#34; or red or kiddish), and it has a comfortable weight to it (neither heavy nor light). I wouldn't be embarrassed to have this sit on my desk at work, either, unlike many of the pink mice I've seen for sale. AND, it's wired! I'm not a fan of Bluetooth mice, so this is nice.I'd definitely recommend this mouse. For an &#34;adult-looking&#34; pink functional mouse, I'm very happy I found this!", "overall": 4.0, "summary": "Overall Solid Pink Wired Mouse", "unixReviewTime": 1375747200, "reviewTime": "08 6, 2013"}
{"reviewerID": "A1E0FJAJUZLEG0", "asin": "B003BEDPHM", "reviewerName": "Granny \"Granny\"", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "The Microsoft Comfort Mouse 4500 does the job I need.  The last mouse I had did not work well so I decided to go with a wired instead of wireless to see if that was better.  And, it is.  Also, more comfortable.", "overall": 5.0, "summary": "Works well", "unixReviewTime": 1380240000, "reviewTime": "09 27, 2013"}
{"reviewerID": "A2D03SBN94Q3IJ", "asin": "B003BEDPHM", "reviewerName": "J. M. Batic", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "This mouse is well made and has a nice design. Its a little larger in the palm area which I feel makes a great resting place for your hand. The wheel has a great feel and its super accurate.", "overall": 4.0, "summary": "Needed a new basic mouse for my pc.", "unixReviewTime": 1372204800, "reviewTime": "06 26, 2013"}
{"reviewerID": "A1UBOTEG97P9ZD", "asin": "B003BEDPHM", "reviewerName": "kittyworld", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I love this mouse. It's very comfortable to hold and very precise. Takes no time for me to get used to it. The scrolling wheel is very smoooth. I understand the complaint of hte wheel click as a middle button, but I never used it, so it doesn't bother me. the Most often used buttons other than the main 2, are the forward and backward buttons. They are not as big as the original MS optical mouse side buttons, but they are less likely to be clicked accidentally. So far I love this mouse and have no complaints.", "overall": 5.0, "summary": "very comfy, very good mouse", "unixReviewTime": 1328486400, "reviewTime": "02 6, 2012"}
{"reviewerID": "A6FR266LGUHQR", "asin": "B003BEDPHM", "reviewerName": "leear", "helpful": [2, 3], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I normally use a naga gaming mouse because it has so many buttons i can macro.  However, it has had a glitch with the system that i would have to re-plug it every time i turned on my pc.  Got tired of doing that so I bought this very simple and basic mouse and I am absolutely pleased with the performance. Even though I lost 12 extra buttons by switching to this mouse I will bear with it because this new mouse is so smooth and accurate. I love how the wheel glides and it tilts as well.", "overall": 5.0, "summary": "Very smooth wheels. Absolutely wonderful", "unixReviewTime": 1325548800, "reviewTime": "01 3, 2012"}
{"reviewerID": "A1WRXACOKPITBQ", "asin": "B003BEDPHM", "reviewerName": "Leiah \"So, I Read This Book Today . . .\"", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I needed it for my laptop, as my pad is about to give up the ghost. After looking around for a bit, I decided on this one for the price, and the supposed comfort of the design. It didn't let me down. It fits exactly into the palm of my hand. As I use my computer for hours at a time, especially for editing, this is perfect for me. Comfort counts!", "overall": 4.0, "summary": "Really like this mouse", "unixReviewTime": 1379203200, "reviewTime": "09 15, 2013"}
{"reviewerID": "A31IUO67L76EC4", "asin": "B003BEDPHM", "reviewerName": "Master Shake", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "Bought this mouse for work.  We use laptops on docking stations.  While I have a wireless mouse, it is a mobile one, so a littlre smaller in size.  I wanted a full size mouse for where I do a majority of my work.  Wired just makes sense in that situation, as its always plugged into the docking station.The mouse has a great ergonomic shape and contours to the hand very nicely.  The two extra buttons on the side are great for foward and back, or can be customized if you choose to install Inetellipoint software (comes with mouse or download from MS).  The mouse behaves great.  Have had it for a couple weeks now.  The only complaint I have is that the wheel is not a click wheel.  There is no resistance in the scroll wheel at all.  I prefer to have the wheel click.  Also, the wheel is smooth, no grips.Overall though, my two complaints arent even enough to drop from 5 stars to 4 stars.  I love this mouse.", "overall": 5.0, "summary": "Great wired mouse", "unixReviewTime": 1305763200, "reviewTime": "05 19, 2011"}
{"reviewerID": "ADLSOBGW5J067", "asin": "B003BEDPHM", "reviewerName": "Matt Rudkowski", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "Use this mouse as a spare in my travel laptop bag. Works like a charm on any surface. Plug and play with both Windows 7 and windows 8/8.1.", "overall": 5.0, "summary": "Great wired mouse", "unixReviewTime": 1387324800, "reviewTime": "12 18, 2013"}
{"reviewerID": "A3MGIOWRRMULJY", "asin": "B003BEDPHM", "reviewerName": "Meydad", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "For what I paid , this mouse is doing a great job.Very accurate and comfortable for photoshop.I'd definitely recommend this product to others.", "overall": 5.0, "summary": "Wasn't looking for anything fancy..", "unixReviewTime": 1364169600, "reviewTime": "03 25, 2013"}
{"reviewerID": "A3I6PALN8WT3MN", "asin": "B003BEDPHM", "reviewerName": "Michelle Lynn", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I love this mouse! It is very cute, but also very good quality, and the settings are very simple to change! The scroll wheel sensitivity was awful when I plugged it in, and I just slowed it way down and it is perfect! Good gaming mouse, too. Love this!", "overall": 4.0, "summary": "Great Product!!!", "unixReviewTime": 1328227200, "reviewTime": "02 3, 2012"}
{"reviewerID": "ACXOSQK2U9ZOI", "asin": "B003BEDPHM", "reviewerName": "Miguel A. Cintron", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "This was a gift for my Honey Love. This is a fairly big mouse for a female hand. She says it fits her hands great. We bought this mouse as a replacement for a wi-fi mouse. I highly recommend this mouse. It tracks well and was easy to install. Excellent buy for the price.", "overall": 5.0, "summary": "Easy on the eyes...", "unixReviewTime": 1369612800, "reviewTime": "05 27, 2013"}
{"reviewerID": "A2IX2PCXS5O2FK", "asin": "B003BEDPHM", "reviewerName": "Mike In San Diego", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I got this as a new mouse for a new system I built. (all amazon parts!) I like the way the sensors are set an an angle so that you can use in on various surfaces.as I &#34;upgrade&#34; my other computer systems, I will be buying more of these!", "overall": 5.0, "summary": "not mickey, but a good mouse", "unixReviewTime": 1365465600, "reviewTime": "04 9, 2013"}
{"reviewerID": "AVQREBUMLU2P2", "asin": "B003BEDPHM", "reviewerName": "Mike Piantanida IV \"Elmojo\"", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "Overall this is a pretty sold mouse, especially for the price.However, if you use AutoCAD or any similar program that uses the wheel button as a click-pan, this is NOT the mouse for you.With or without the extra software, clicking the wheel will pan, but there's a lag of about 0.1-0.2 seconds.This sounds trivial, unless you're drafting at full speed, then it's maddening and useless.", "overall": 3.0, "summary": "Okay mouse, with one fatal flaw", "unixReviewTime": 1382140800, "reviewTime": "10 19, 2013"}
{"reviewerID": "A36WTXJBYS3DB6", "asin": "B003BEDPHM", "reviewerName": "N. B. Kennedy", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I bought this mouse to replace another Microsoft, the 1058, thinking I was buying a wireless mouse. My mistake, no fault of the manufacturer. So, right off the bat, I don't like the cord. It's constantly rubbing over something on my desk (which is not that neat!), a sound that bothers me, or gets caught on something, which slows down use of the mouse. It's also made of some sort of soft material -- rubber? -- that is perpetually sticky, even after I try to wipe it down. For ergonomic reasons, I wanted the longest mouse I could find, but this one is short and fat enough (height-wise) to cause me pain in my wrist. I've rigged up the old mouse receiver with adhesive poster putty to create a wrist rest so that my wrist isn't constantly in a bent position. It's a pretty clunky solution. I've been looking on ebay for a 1058, which is no longer made, but so far no luck. I hope to replace my old mouse soon!", "overall": 2.0, "summary": "Annoying and not comfortable", "unixReviewTime": 1393977600, "reviewTime": "03 5, 2014"}
{"reviewerID": "A2DIUTSBHF3EZD", "asin": "B003BEDPHM", "reviewerName": "News", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "Cute and well made, my girlfriend loved it.Fwd and Back buttons are nicely positioned and you dont hit them by accident.The mouse is thicker than you think it would be (more bulbous) and works very well!", "overall": 5.0, "summary": "Pinky!", "unixReviewTime": 1388016000, "reviewTime": "12 26, 2013"}
{"reviewerID": "A3QZX3FE8FPSIL", "asin": "B003BEDPHM", "reviewerName": "Nicholas Gosey \"platypi007\"", "helpful": [16, 20], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I will leave my original review intact below, but after a year and two months I became fed up with this mouse and bought a new one. Here are the reasons why:First, while the construction felt sturdy, it did not hold up. The black part of the body is covered in rubber which soon began to break down. It now looks terrible, pitted, and worn.The other major flaw of this mouse is the scroll wheel. Rather than the rubber coated wheel I am used to it has a wheel with a rubber band around the outside of it. This band soon became malformed and would come off the wheel, interfering with the scroll mechanism. Not long after that, the rubber itself began to break down, leaving gooey, black clumps behind, often gumming up the scroll mechanism. The problems with scrolling were just not worth continuing to use this mouse. Microsoft used to make excellent mice, but I have moved on to other companies now that they have stepped down their game. What happened to the quality of the Intellimouse?I also never really did get used to the free scrolling wheel, though I did like it in some situations.If you're looking for a good mouse check out the Logitech G400, it is what I replaced this one with. I'm sure that Logitech's other offerings are of similar good quality.----------Original review:I got this mouse to replace the Microsoft IntelliMouse Optical that I have happily been using for years now. It had become my favorite mouse but they have stopped making it so I had to find a new option. Having used a few notebook mice I knew that a small mouse was out of the question for my big hands--extended use of a small mouse makes my hand hurt so I had to look for a full-sized option.I toyed around with the idea of a full-sized wireless mouse but was unable to find one that had the button configuration I was looking for and I was concerned with weight and reception quality, so I decided to go for a wired mouse and the Comfort Mouse 4500 has a similar button configuration to the old IntelliMouse Optical (five buttons: the two normal ones, middle click on the scroll, and one on either side for forward and back in the browser). In addition to this it also has the horizontal scroll on the wheel which I thought might be a nice, if rarely used, feature.First impressions:Size - The size of this mouse is great, similar to the one it replaced. It fills my hand perfectly so I think I'll have no problems using it for extended periods of time.Shape - The shape is a little more squared off on top, which is a bit less comfortable for my ring finger than the curves of the IntelliMouse optical.Button layout - The side buttons are much smaller than on the IntelliMouse Optical, but still very convenient to my thumb and ring finger. The middle click button under the wheel is very firm, I wish it was a bit looser. (It may become easier with use.)Wheel - My one complaint about this mouse is the wheel. It has a free-scrolling wheel rather than a stepped clicking wheel. While this *is* better than the very firm click some mouse wheels I've tried have had, it is a bit disconcerting at first. The free-scrolling makes it very hard to ctrl-scroll zoom websites accurately. Perhaps I will get used to it. The free-scrolling combined with the firm middle click means that I tend to scroll while trying to middle click which could, perhaps, lead to problems.Side scrolling - I've never used a mouse with this feature and I don't foresee using it a terrible lot. I imagine it would be useful for large spreadsheets and such. It isn't a very natural motion to me (perhaps I would have said the same of scrolling fifteen years ago?) and since the wheel is free-scrolling it tends to scroll vertically a little bit while I'm using the side scrolling.Tracking - The BlueTrack technology seems to work well. It tracks equally well on my cloth covered mouse pad, wooden desk, and a glossy book cover. The only thing I tried on which it wouldn't track was a mirror. The response is perfect for me and I've got the pointer speed set about where it was for the last mouse I used. Precision seems excellent.Other - I like the overall look of the mouse, and the fact that it doesn't have the annoying extra LED that they used to feel was needed to let everyone in the world know you were using an optical mouse. This mouse only has two \"feet\", larger than the four mice of the past have used, and that seems to work just fine. Maybe they won't come unstuck from the bottom as quickly. I like the rubberized grip (the black part is rubberized).Final thoughts:This mouse is a great replacement for a full-sized mouse with similar button layout. It fits a large hand perfectly and is also ambidextrous for those who need a left-handed mouse. The only major drawbacks are the free-scrolling wheel and overly firm middle click button. The slightly angular design of the body is a minor drawback.Pros - Size (perfect for large hands!), ambidexterity (for left-handed mouse users, of which I am not), button layout, tracking, look.Cons - Free-scrolling wheel, firm middle click, angular design not comfortable (a bit ironic considering the name, but you can't please everyone).", "overall": 1.0, "summary": "Good mouse for larger hands, a few small flaws", "unixReviewTime": 1312761600, "reviewTime": "08 8, 2011"}
{"reviewerID": "A2T1CRZ12GUT8Z", "asin": "B003BEDPHM", "reviewerName": "Oahu Computer Guy &amp; Foodie", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "What can I say, this is a great, 'strawberry' mouse.  I don't mind the color and at a significant discount to the black one.  It works well, I would recommend this line of mice to anyone and everyone!", "overall": 5.0, "summary": "Great Mouse", "unixReviewTime": 1371081600, "reviewTime": "06 13, 2013"}
{"reviewerID": "A3BEB9YCTGFIPY", "asin": "B003BEDPHM", "reviewerName": "Olney Nate", "helpful": [1, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "the mouse tracks very nicely, but I find the wheel totally horrible.  It rolls readily & totally smoothly -- i.e. no \"clicks\" and no resistance whatsoever -- ironically making scrolling far from effortless.  After correcting for the vague over- or underscrolling that's to be expected en route to the desired scroll amount, one has to be very careful/attentive not to brush the scroll wheel and inadvertently scroll more when placing a hand on, or removing a hand from, this mouse.One reason I got this mouse was because of the tilt-wheel switches, but I don't use the side-tilts for the same reason:  inadvertent scrolling during lateral movement.(Inadvertent scrolling is also an issue to be careful about when using the wheel to middle click.)After enough accidental clicks of the side button; they're now disabled, too.  .... or maybe not.  I just reached to do something with the mouse, inadvertently both moved the wheel *and* touched a side button, and found the text size on the page suddenly got bigger.  Bizarrely, I find I can only make text bigger, not smaller!!! so hopefully I can resolve this by revisiting the configuration SW.Also, you have to download the SW from the web.  Fine; but the web site provides 2 software components for this mouse, and installation of the second fails, as it says a newer version of this SW is already installed on my Win7 box.  I can't find that 2nd package in my start menu nor in the installed programs list, so I don't know what's up with that.Also -- and I don't know if this is something in Google Chrome or with this mouse, but -- I find Chrome's responsiveness to this mouse slow.  This is something I never noticed with my previous mouse -- or any other mouse/app combination ever before on any machine, for that matter.  for example, I middle click 2 adjacent links to open them in new tabs:  the 1st link opens in a new tab, but -- even though I clicked it while the mouse cursor was over it -- the 2nd middle click is processed as if it occurred in the space between the 2 links.Bottom line recommendation:  find something else.", "overall": 1.0, "summary": "the wheel is horrible; the side buttons are awkward", "unixReviewTime": 1360368000, "reviewTime": "02 9, 2013"}
{"reviewerID": "A3NZCIE45F45BT", "asin": "B003BEDPHM", "reviewerName": "OptimusPrime", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I started using this mouse recently and have started liking it. There is nothing bad about this mouse and all its features work excellent. I recently stopped using my wireless keyboard and mouse because of it connectivity/sleep activation and precision issues in case of mouse (wireless). I ordered Microsoft Natural Ergonomic 4000 Keyboard as it was the best available wired keyboard from Mircosoft. Strangely it wasn't sold along with a mouse of same style and looks. So after looking for a while, I came across this mouse and thought of giving a try. They both go well looks wise. Following points would describe its pros and cons;PROS:- Professional looks. Excellent styling and looks.- Quality material. It has a mat finish and not glossy.- Guaranteed precision pointing. Perfect movement and precision pointing which was one of the reason I moved to wired components.- Scroll wheel is amazingly smooth and works perfectly fine. Important point to note is, download its configuaration software from [...]Once you install this software cum drivers, you can configure the scroll wheel according to your requirement. I read reviews about scroll wheel not working properly but it's incorrect. Horizontal and Vertical scrolling works absolutely fine. Though remember it's a smaooth scroll and there is no clicks when you scroll vertically. I love it.- Left button and Right button can be set in the configuaration software to ease our tasks. The default assigned purpose of these buttons is to go Forward and Back while browsing.- So called its BlueTrack technology works well on wooden desk, paper and leather like material. Though keep in mind the mouse works on a light beneath it, so it won't work on transperent glass or mirrored surface according to the manual.- Plug and play, No hassel. Basic feature like vertical scroll and pointer started working out of the box. For all other extra features install the software from the above link.- Fairly priced, may be on the cheaper side.CONS:- Personal opinion: the width on top of the mouse is bigger than most of them available in the market. I have a small hands though it's not a big deal, I may get used to it soon.Overall:As expected from Microsoft, this product is a well built product with pro looks and that is why I prefer Microsoft over any other brand (even Logitech). Yes it costs more but what you get is what you pay for. I am a Software Engineer and have ordered this mouse for daily use at home. No more the mouse sleeps or looses its smooth pointing and also no more battery issues.Though I recommend not to forget the installation of the software cum driver from Microsoft's website. Check out the images I have uploaded. So far satisfied. If I found any issues, I will update this review.Happy pointing and scrolling :).", "overall": 4.0, "summary": "Best amongst wired mouse", "unixReviewTime": 1357430400, "reviewTime": "01 6, 2013"}
{"reviewerID": "A2NQ7PNES5I8E5", "asin": "B003BEDPHM", "reviewerName": "Pamela", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I bought two of these. I got the \"Strawberry\" color because it was the cheapest. It's actually a light pale pink, so it's not too garish. They mice function quite well and they are comfortable for my small hand. There are two buttons on both sides of the mouse that are fully customizable.", "overall": 5.0, "summary": "Nice Mouse!", "unixReviewTime": 1365984000, "reviewTime": "04 15, 2013"}
{"reviewerID": "A2N4QZ92NBKJZZ", "asin": "B003BEDPHM", "reviewerName": "Phaeton", "helpful": [1, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "20 bucks for a mouse that made it less than three months. The FileMate costs around 7 bucks and lasts me about a year. The wire frayed and loosened after about 7 weeks and the whole thing went south a week or so later. Time for a new one; this time it will be another FileMate.", "overall": 1.0, "summary": "Feels great; works great...until it breaks", "unixReviewTime": 1393286400, "reviewTime": "02 25, 2014"}
{"reviewerID": "A43QDXPU9PW9G", "asin": "B003BEDPHM", "reviewerName": "P. Halls", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I have two of these for use where space is an issue. I use them with a lap top and a note book.", "overall": 5.0, "summary": "Nice Little Mouse", "unixReviewTime": 1382572800, "reviewTime": "10 24, 2013"}
{"reviewerID": "A2NBX8HZMKJSCK", "asin": "B003BEDPHM", "reviewerName": "Phillip Phan", "helpful": [5, 5], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I bought this for my wife who had problems using a tiny travel mouse for long periods of time. It was a perfect fit for her as she should stretch out her fingers.  The mouse plugged in and immediately worked with no problems. Good price, good buy", "overall": 5.0, "summary": "Perfect size", "unixReviewTime": 1384128000, "reviewTime": "11 11, 2013"}
{"reviewerID": "A11B8XHBEIOLA", "asin": "B003BEDPHM", "reviewerName": "Reem Banafea", "helpful": [1, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "as a mac user, since valve corp released steam and it's games for mac! I was looking for a cheap alternative of apple's mighty mouse \"wireless\" because the lack of accuracy and since I don't use it's features a lot! this mouse solved the problem, not to mention quicker at browsing the web! works on any surface! although it's a little awkward to me to see a PC equipment on a mac computer! this one is an exception!", "overall": 4.0, "summary": "for palm grip type you'll get used to it quickly!", "unixReviewTime": 1292198400, "reviewTime": "12 13, 2010"}
{"reviewerID": "APIP8ZKGBMWBH", "asin": "B003BEDPHM", "reviewerName": "Richard2519", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "This mouse is identical to the gray mouse offered by Microsoft and it's less than half the price. So who cares about color? This mouse works exceptionally well. The blue laser works on everything except pure white. It also has four buttons and the scroll wheel has tilt control as well as the center switch. Plenty of function for most people. I bought two in case my dog eats one or my grandkids dunk it in their milk.", "overall": 5.0, "summary": "Red is good!", "unixReviewTime": 1378166400, "reviewTime": "09 3, 2013"}
{"reviewerID": "A1ZQM8TBP4XETJ", "asin": "B003BEDPHM", "reviewerName": "Robert L. Van Vugt", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "Bought two of these, they work OK however with time it seems the chemicals from your hand effect the rubber material that the side grips are made from and deteriorates the rubber, leaving spots where your fingers are in constant contact. Logitech products do not appear to have this same issue. Does Microsoft even test there stuff anymore?????  I think the consumers are becoming the test dummies.  This defect should have been caught during Microsoft testing.  Both of these mice I bought have this problem. I recommend Logitech Mice as I have no problems with them.", "overall": 2.0, "summary": "Poor Quality Materials", "unixReviewTime": 1394496000, "reviewTime": "03 11, 2014"}
{"reviewerID": "A1G3A2YQPLRODG", "asin": "B003BEDPHM", "reviewerName": "Rose Anonymous", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "Best mouse I've had.  After getting a replacement Apple mouse and trying others I finally found a winner.  Responds with a light touch to the wheel...many settings & compatible with my IMac.  Can program buttons as I wish with my Mac.  Especially like the back and forward buttons.  Like it so much I bought a spare!Update...3/11 - mouse acting squirrelly.  No squeak, neither mouse squeak or squirrel squeak, but erRATic behavior.  (Hope it's just this one, 'cause I bought a couple more.)", "overall": 5.0, "summary": "Great mouse !", "unixReviewTime": 1288915200, "reviewTime": "11 5, 2010"}
{"reviewerID": "A2MQG483R9KOSR", "asin": "B003BEDPHM", "reviewerName": "Ross", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I bought 2 of these, and each makes a loud \"click\" noise when you click one of the buttons.  One of them must have a broken spring in it because it makes a sort of \"ping\" noise, which is louder but totally different from the other mouse.  If there are other people in the room with you it is very annoying.  The cord length and functionality are great, but the clicking noises make this a poor mouse.", "overall": 2.0, "summary": "Noisy", "unixReviewTime": 1358294400, "reviewTime": "01 16, 2013"}
{"reviewerID": "AUG4F15FEX7TP", "asin": "B003BEDPHM", "reviewerName": "Ryder Ripps", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "i personally find this mouse to fit my hand really well.. and whats up with the haters who dont like smooth scroll wheel.. smooth scroll wheel totally rules.. get with the program.. the back and forward buttons are great and surprisingly microsoft has software for mac that makes this thing programmable.. cool beanz", "overall": 5.0, "summary": "one of the best mice..", "unixReviewTime": 1366070400, "reviewTime": "04 16, 2013"}
{"reviewerID": "A3PZKEF7GGGY10", "asin": "B003BEDPHM", "reviewerName": "serendipity", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I had this mouse assigned at work and i loved it so much so i had to get one for myself at home !", "overall": 5.0, "summary": "love it !!", "unixReviewTime": 1371340800, "reviewTime": "06 16, 2013"}
{"reviewerID": "A2WW57XX2UVLM6", "asin": "B003BEDPHM", "reviewerName": "Talvi", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "I find the mouse to be very comfortable and easy to use.  It is replacing a logitech mouse whose buttons were harder to press (more resistence) - the buttons on this mouse click easily and quickly.  The scroll wheel is easy to use and in nearly all things, the mouse lives up to the promise of being comfortable, consistent, and easy to use.I rate it a 4 star instead of 5 for two reasons:  1) the buttons when clicked are very loud.  My spouse has commented that it is annoying and he can hear it two rooms down when I am on the computer.  2) the scroll wheel doesn't click in sections - it just rolls freely.  I prefer a mouse with a scroll wheel that stops on a click after a full rotation.  It makes it easier to scroll when you have sections.Otherwise, I am very pleased with this mouse.  It replaces two Logitech mice that were too annoying to use.", "overall": 4.0, "summary": "Comfortable, Easy to Use, but Loud Clicking", "unixReviewTime": 1300838400, "reviewTime": "03 23, 2011"}
{"reviewerID": "A391RJ8646SYY1", "asin": "B003BEDPHM", "reviewerName": "Tom Barrister", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "After 15 minutes of using this mouse, my right hand ached.  I'm on a computer several hours a day, and I generally have no issues with using a mouse.  This one has no contour to it whatever.  It's a semi-elipse.  Those with huge hands might like it.  If you're used to a contoured mouse, this one probably won't be what you want.", "overall": 2.0, "summary": "Where's the comfort?", "unixReviewTime": 1371168000, "reviewTime": "06 14, 2013"}
{"reviewerID": "A3NLZ70MS32P7I", "asin": "B003BEDPHM", "reviewerName": "Victoria Nelson", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "One of the most comfortable mice I've used. Great value for the price. I actually got another in a different color for my husband and he agrees.", "overall": 5.0, "summary": "Amazing mouse for the money spent", "unixReviewTime": 1386892800, "reviewTime": "12 13, 2013"}
{"reviewerID": "A1EUU0SO9TQSYV", "asin": "B003BEDPHM", "reviewerName": "William B. Houseman \"Bill H\"", "helpful": [0, 0], "title": "Microsoft Comfort Mouse 4500", "reviewText": "Hard to believe this is a Microsoft product. The buttons work OK, and it is a reasonably comfortable fit for the hand, but when you click the left button it sounds like a child's Cricket Clicker, much too loud. And it squeaks. I'm already looking for another brand of mouse.", "overall": 2.0, "summary": "Looking for another mouse", "unixReviewTime": 1391212800, "reviewTime": "02 1, 2014"}
{"reviewerID": "AZCE11PSTCH1L", "asin": "B003BEDPHM", "reviewerName": "yoyo", "helpful": [0, 1], "title": "Microsoft Comfort Mouse 4500", "reviewText": "This mouse is a good mouse except for the picture is deceiving. The picture shows an all black mouse, but when I got it the mouse was a two tone color grey and black. This is the reason I gave this product only a 3 stars which if it would have matched the picture I would have given it a 5 star rating.", "overall": 3.0, "summary": "mouse", "unixReviewTime": 1365033600, "reviewTime": "04 4, 2013"}
{"reviewerID": "AIGDECC1J99QT", "asin": "B0054JJ0QW", "reviewerName": "C. J. Healey \"ZCT\"", "helpful": [172, 198], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "A few years ago flying on a cross country trip I was fortunate enough to be bumped to first class.  I sat next to a rich dude who subtly bragged about his material possessions and owned property during take off and landing.  One of the items he bragged about was his new Bose headphones, and he insisted I listen to them.  Sure enough, they were outstanding, but I didn't travel often enough to justify the price tag.Well fast forward a few years and I now have a job that requires me to fly a few times a month.  So I took the plunge and used my hotel loyalty points to get me a free set of these Bose headphones.They impressed me out of the box as much as the very first time I listened to them (or the equivalent I had tried a few years back).  The noise just melts away into the background so that it is hardly noticeable at all.  I took my first flight with them today and tried them in a very busy crowded airport terminal.  My music sounded wonderful, and the cacophony of random people and machine noise all but vanished.  And that was quite a challenging test, the noise levels were pretty high in a fairly confined round terminal hub.  The music source was simply my phone, a Samsung Infuse, not a dedicated music player.Next I wore them on a plane for a short 80 minute jet flight.  It's like being in a different world.  The music from my android phone sounded awesome, the noise practically vanished.  Somehow without the constant racket of the plane the time seemed to just go by quicker too.The headphones were extremely comfortable, and the excessively hot day didn't add any problems either.To me Bose are a company I have a lot of respect for.  They always seem to innovate and amaze.  As an audiologist I am well versed in acoustics and the physics of sound, and to create this level of noise reduction so seamlessly is very impressive, especially if their claims of battery life are close to accurate.The headphones fit in a very attractive slim case.  There is even a little space in there for a couple of spare batteries if you wanted.  This model ships with a standard headphone cord and also an iPod/iPad/iPhone version which has a microphone on the wire.  I question how useful that would be simply because when you wear these headphones it is hard to tell how loud your own voice is to some extent, so I'd be worried about shouting to the person on the other end of the phone, and also if it is noisy enough to wear them, I wonder how well the person being called would hear anyway.  In any case, I replaced my iPhone with an Android based phone recently so I've not tested that feature.The bottom line is these are expensive headphones.  Truth be told if you go to Best Buy and listen to some other headphones at half the price, you'd probably get better or similar sound quality.  What you won't get though is the incredible noise reduction system that Bose has been working on for many years.  That combination of a great sound AND the noise reduction is what makes this product work.  If your life involves plenty of air travel, or other similar travel that includes background noise, then these will really improve that journey for you.  Music sounds great, audio books are far easier to hear, even Angry Birds is more enjoyable without all that background noise.  In fact when you put these on in almost any environment, it makes you realize how much ambient noise there is in so many places.I think the only real issue is if your budget and lifestyle justifies the price tag.***Update: Since writing this I have also tried watching a DVD on my laptop in my hotel room.  Again these headphones eat through noise like the air conditioning, ventilation in the bathroom, noises from other guests, the whir of the DVD drive, the refrigerator etc.  The sound quality off my laptop was just exceptional too, rich bass, clear treble, good mid tones.  I can already see myself using these for more than just plane rides.", "overall": 5.0, "summary": "Bose Doesn't Disappoint", "unixReviewTime": 1310342400, "reviewTime": "07 11, 2011"}
{"reviewerID": "A3D7528X5OW9DD", "asin": "B0054JJ0QW", "reviewerName": "cruzy42 \"cruzy42\"", "helpful": [2, 4], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "Seriously, Bose, the cord looks awfully flimsy for a $300 item. And it turns out, it actually IS that flimsy. With light use, and no cordwrapping of any kind, the thing started cutting out within six months. Now it's unusable, the internal wire apparently cracked or severed (looks fine on the outside). I'll look into my warranty options, but I Am Not Pleased. Won't by Bose again.", "overall": 2.0, "summary": "Cord failed within six months", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A2GDEB47V3NVKQ", "asin": "B0054JJ0QW", "reviewerName": "customer 101", "helpful": [1, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "Great headphones... I love the noise cancellation.  I am wearing them right now and can't even hear my typing!  Some people are complaining about the bass is to heavy for rap...  Isn't that a good thing? Also try on a pair of beats!  SO MUCH more bass with beats.  I like them.But a little pricey.", "overall": 5.0, "summary": "Awesome!", "unixReviewTime": 1333929600, "reviewTime": "04 9, 2012"}
{"reviewerID": "ABDFB5WZ5MYCR", "asin": "B0054JJ0QW", "reviewerName": "C. Yost", "helpful": [3, 3], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "My brother has recommended these for years and I finally decided to pick up a pair. All I can say is Wow! These are amazing noise cancellation headphones. They are extremely comfortable and the 'no wire' option is a huge plus.I have to admit, I haven't used these while flying yet. I have used them in my cube-land office setting and I have found that they help me concentrate and minimize distractions. (If you work in cube-land, you know what I'm talking about. My office environment isn't noisy, but it isn't quiet either. People taking on the phone, the annoying guy that has a radio in his cube turned up just enough that you can hear it but can't tell the song, impromptu meetings held in hallways, loud talkers, etc.)So what do you get for $300? The headphones, carrying case, battery, aircraft headphone adapter, two different wire options for listening to music - one with a combination in-line volume control/microphone for cell phones, one just for listening.I have to admit the $300 price tag was an issue for me. However, I am an audiophile and have loved Bose speaker systems since I purchased my first stereo system. The speakers on these headphones do not disappoint. For those who are new to Bose, they are a bit heavy on the bass. If you're looking for music headphones, I would suggest trying on and listening several different pairs - this is a totally subjective area. What I like and what you like may be totally different. However, if you are looking for a set of noise cancelling headphones, these are fantastic. The bonus is that you get a Bose sound system in addition to noise cancellation.For the record, I've used in-ear type earbuds for years that were billed as 'noise reducing' or 'sound isolating.' You know the type - they fit in your ear and physically block out the sound. The problem is that after a few hours, my ears would be sore. I certainly liked the small form factor (easy to lug around), but was always a bit disappointed by their performance with music and with noise cancellation. In addition, ear buds are notorious for breaking.In addition to the great sound (or lack thereof), they are very comfortable. I've worn them most of the day and I haven't had any complaints. I have a rather large melon and they fit me very well. From speaking to others who own a pair, they seem to fit almost any shaped head well. They are also comfortable in 'DJ' mode (when you have one cup off your ear to hear what is going on around you). These headphones have a solid feel, yet flexible. I've owned other over the ear headphones (Sennheiser, Denon) and these compare very well to them as far as build quality.Finally, the nicest surprise was the quality of the carrying case. These store flat (the ear cups rotate) and the case does not take up a lot of space. There is also room for any extras you may want to carry - it can comfortably carry the aircraft adapter & cords in the included mesh zipper bag. There is also room for an extra battery or two, a small USB charger, etc. You won't be able to pack a lot in the case, but it is sized well. The case makes it easy when packing - I carry a laptop and the case slides right in. Packing for a trip would be no different.The only con I can think is having to carry around an extra 'AA' battery or two, but this is minor compared to how well they work. The plus side is finding a battery won't ever be a problem - almost every airport gift-shop carries double A's.Overall a great set of noise cancelling headphones. Highly recommended.", "overall": 5.0, "summary": "Wow! Amazing headphones, fantastic noise cancellation!", "unixReviewTime": 1367884800, "reviewTime": "05 7, 2013"}
{"reviewerID": "A464DN1VJJVLQ", "asin": "B0054JJ0QW", "reviewerName": "Dan", "helpful": [2, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I am very picky about sound, have a high end stereo at home. The sound of the QC15 is outstanding, you can easily separate sound components, the bases are deep enough to be real-like and rounded without sharp surroundings, not the tap-tap sound of cheap sound systems. I haven't tried it on a plane but at home it nicely muffled completely my noisy heating system, grand kids screaming in the house, the old fashion flashing toilet, oh well you get the idea. If in doubt, give it a try, the return policies are excellent.I didn't give a 5 star simply because I don't know what perfect is.", "overall": 4.0, "summary": "Sound", "unixReviewTime": 1392076800, "reviewTime": "02 11, 2014"}
{"reviewerID": "A3PWX1VQN0EJM5", "asin": "B0054JJ0QW", "reviewerName": "Daniel Ford", "helpful": [1, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I avoided Bose earphones for years because of their high price, instead settling for Audio Tech. The Audio Techs finally gave me feedback troubles, so I bought a new pair, and they exhibited the same problem right out of the box. So I returned them and bought Bose instead. They have been fine. I think the noise canceling is a bit better as well (or perhaps it's the earphone fit), but the great advantage has been the lack of howling that afflicted the earlier earphones whenever I moved into certain positions. (I wear them at the gym to mask the awful music piped into that place, so this might not be as much of a problem for the road warrior trying only to silence the jet engines.) Anyhow, the Bose earphones were well worth the additional cost.", "overall": 5.0, "summary": "Excellent", "unixReviewTime": 1400803200, "reviewTime": "05 23, 2014"}
{"reviewerID": "A1SC5OXLQNGPLN", "asin": "B0054JJ0QW", "reviewerName": "Dan InGold \"xz38\"", "helpful": [2, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "The sound quality coming from this headphone is exactly the same as bose ae2. The noise canceling is fantastic. You don't even have to listen to any music, once you turn it on, you will stop hearing most of noise.However, I really cannot wear this phone for more than half hour. I feel ear pressure immediately, like I'm taking a high speed elevator, my ears get sweating, and hot. The pressure sends a biological response to my stomach and thus feel a little sick. I love the sound and function. But obviously, this is not for me.The other downside about this earphone: it is tied to a AAA battery. It cannot function without using the battery.", "overall": 3.0, "summary": "Too much ear pressure, prefer to ae2", "unixReviewTime": 1377734400, "reviewTime": "08 29, 2013"}
{"reviewerID": "A5O57UUL7OH1H", "asin": "B0054JJ0QW", "reviewerName": "David L.", "helpful": [1, 3], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "Best noise canceling headphones I've seen.  With music going, ambient and other noises just fade away.  A must have for traveling, or just to really enjoy music.", "overall": 5.0, "summary": "Outstanding", "unixReviewTime": 1364342400, "reviewTime": "03 27, 2013"}
{"reviewerID": "A2KW039CDK63O3", "asin": "B0054JJ0QW", "reviewerName": "David McKee", "helpful": [2, 3], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I recently broke my old Sony's so I decided to try these to despite the stupidly high price. I have to say the headphones are amazing and I can't find any complaint at all. Except the price.", "overall": 5.0, "summary": "Great Headphones", "unixReviewTime": 1399766400, "reviewTime": "05 11, 2014"}
{"reviewerID": "A2D1ZQEFS1NBH2", "asin": "B0054JJ0QW", "reviewerName": "David Washington \"little dave\"", "helpful": [0, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I've had a pair for about 10 years. These are the best NC headphones overear! I brought a second pair just to have the blue. Purchased the QC20i and I don't think they comparing well.", "overall": 5.0, "summary": "Hands down the best!", "unixReviewTime": 1392854400, "reviewTime": "02 20, 2014"}
{"reviewerID": "A2Y774RR1LUVNH", "asin": "B0054JJ0QW", "reviewerName": "David Whitcher", "helpful": [4, 4], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I have owned these wonderful Bose headphones for a couple of years now and use them several hours a day. They are still going strong.  Here are some pro's and con's:THE GOOD- The sound spoils me. Really. It is hard to tolerate listening to music with any other lesser speakers (not just headphones).  Indeed, with these, One hears nuances in my music that I did not notice before. The way I would describe the music is CRISP, deap and spacious.- Noise canceling is excellent. I am disabled after suffering brain trauma and  cannot tolerate much noise nor commotion around my home - yet I have three small kids!  These Bose save the day; all-day and everyday. I can block out most of the noise with the noise canceling just turned on without music. When the rest of the noise needs to disappear, I simply play some light music from my iPad. The world magically becomes completly silent. love them!- They are extremely light and comfortable. I can wear them for hours a day with very little fatigue. These are the only over the ear headphones which I have owned that do not rub my ears and cause irritation.- I love that e cord easily detaches from the headphones so that I can take advantage of the noise canceling without chords.THE BAD- They do create a practically airtight seal which causes a weird air preassure change that you feel. Wearing them with the noise canceling turned on thus has an effect on your ears as though you were swimming a few fear under water. I have gotten use to it but it took me a few days. Everyone whom I have had tried he headphones, notices this air preassure change. Yet, they tolerate it because they are blown away by the noise canceling and the quality of sound.- The only other con is that they do cause my ears to heat up and slightly sweat. I find that I need to take the headphones off every 30 minutes or so, just to give my ears a breather for a few seconds.In short, these bose QC 15's come highly recommended. If your purchase them, I can pretty much gaurentee that you will enjoy them and feel that they are well worth the money.", "overall": 5.0, "summary": "2 years in - I love them as much as day one.", "unixReviewTime": 1402099200, "reviewTime": "06 7, 2014"}
{"reviewerID": "A3LQ8TPYY3MDL0", "asin": "B0054JJ0QW", "reviewerName": "Deana Jirak", "helpful": [1, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I can't say enough positive things about these headphones. They are so comfortable and put you in a bubble of silence. I wear them at work, no music playing, just to block out coworkers. Highly recommend. I've wanted them for years and they totally live up to their hype!", "overall": 5.0, "summary": "Silk Silent Pillows for Your Ears", "unixReviewTime": 1334966400, "reviewTime": "04 21, 2012"}
{"reviewerID": "A25GTJSWPAGXE5", "asin": "B0054JJ0QW", "reviewerName": "D. Falkner", "helpful": [1, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I listen to classical and high fidelity orchestrated music. When I'm feeling really good I listen to trance, ambient techno, and so forth - the QC15 neve, EVER disappoint. Although I have I have wanted more BASS it is not the fault of the phones but the hardware. These phones will expose the quality of your hardware very fast. Be careful not to blame them for the hissing and so forth as it is almost always the hardware the BOSE QC are connected to.I see so many young people with these DR Dre phones on and I have used them - you have no idea the amount of BASS and treble the BOSE can produce that will destroy the Dre's (yes at a +$100 difference) if the hardware allowed you to up it. Hands down the quality and FIDELITY are off the charts. Always have a single spare AAA on hand bont dont stress out - the battery lasts about 3-4 weeks and that's using the QC 15's daily (for a total of about 40 hours non stop).The only complaint I have is that for $300 the QC 15's come with a fairly cheap cable. I got a year off mine, including traveling on a weekly basis before it started coming apart. They needed to have a braided cable like the monster cables do or something (the cable does not allow for poor audio quality so dont worry).  other than that the phones are a MUST HAVE.I highly recommend them to anyone who flys alot.", "overall": 4.0, "summary": "hands down the best", "unixReviewTime": 1331510400, "reviewTime": "03 12, 2012"}
{"reviewerID": "A28ND0LUI1MZ8V", "asin": "B0054JJ0QW", "reviewerName": "D. Goulian", "helpful": [33, 37], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "These headphones are rated pretty high, but not from anyone who has owned a pair of them for a significant period of time. So let me fill you in on some serious quality issues I have seen after owning a pair for about 6 years (in the order the events occured). Mind you I have always babied these things and kept them in the hard case, so thats why I find this particulary disturbing (well, that, and the fact that they cost $300).1. About 3 years ago, as I was adjusting the headband, I noticed that the plastic had broken where the two pieces slide into one another. It was bad enough that crazy glue was not an option. So I contacted Bose fully expecting to be able to get them repaired or replaced for a reasonable fee. No such luck. The Bose rep told me I could purchase another pair, period. He may have offered a discount, but it must not have been a very good discount because I recall ripping him a new one for such bad support. I was going to throw them away, but I took one more look at the damage and decided the try to fix the broken area with some tightly wound electrical tape. This worked well enough, so I kept them, determined to get a few more months out of them.2. About a year ago I noticed that the on/off switch was intermittant. You have to push extra hard to the right to get the red light to come on. Wierd, but I can live with that.3. This past weekend I placed the headphone earpieces down on my dads fine wood clothing bureau and when I picked them up a few hours later I noticed that some of the soft cushion had stuck to the wood! It appears that the cushion is deteriorating!! There were little black cushion bits everywhere. There was nothing on the wood surface to cause this, except possibly for some very light wood polish.Now, these things would be forgivable if this was a cheap pair of headphones, but this is BOSE for gosh sakes, and these cost $300! Whats up with that? You buy a brand like Bose precisely becuase you assume the quality after 6 years will be excellent, not just fair or good.So, yes, the sound quality is very good. And I am sure they have made some design changes in the past 6 years. But the overall quality of the pair that I have is  most certainly NOT good. Have they addressed all of these issues in the current model? I have no idea. The BOSE rep did not tell me about if they did. But based on my experience I am very dissapointed in BOSE and will never again waste my hard earned money on a pair of thier headphones again. There are plenty of other noise cancelling headphones out there that are just as good, for alot less $$. My advice is shop around and consider this review before you fork over big bucks for these headphones.", "overall": 2.0, "summary": "Beware of long term quality issues...", "unixReviewTime": 1339027200, "reviewTime": "06 7, 2012"}
{"reviewerID": "A39MUHKM7OUXSG", "asin": "B0054JJ0QW", "reviewerName": "D. Hamm", "helpful": [1, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "Summary: mediocre microphone, comfortable for all-day wear, suggest rechargeable batteries for daily use.I use these in the office mostly and for occasional travel. The noise cancellation is really great while traveling, but get a headset with a more directional mic if you plan on using it for phone / Skype calls. Unfortunately the mic hangs facing away from your mouth, picking up other people and room noise. My office is not extraordinarily loud, but in order to use this as a headset, I must hold the mic directly in front of my mouth with one hand and have the other hand ready with the mouse to mute/unmute the mic.I recommend rechargeable AAA batteries. I go through about 1-2 every weeks, depending on how much I use them for music. The 35-hour estimated battery life seems accurate.", "overall": 3.0, "summary": "Not great for skype calls - microphone picks up other people and ambient noise", "unixReviewTime": 1341878400, "reviewTime": "07 10, 2012"}
{"reviewerID": "AT5BP7OVH92WT", "asin": "B0054JJ0QW", "reviewerName": "Dinesh A. Gomes", "helpful": [5, 6], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I decided to invest in a pair of these or similar to cut out the noise around cubicles at work when I want to focus on something. I am easily distracted. A friend of mine had a Dr. Dre Beats headset which is the same price, so it was between this and the Beats.Here's my observations and basis for a 4 star review:- Background noise cancellation: works perfectly - they seem to have perfected the art of cancelling out the background hiss of ambient noise or white noise, if you can call it that.- Used them on an aircraft, and they were great at cutting out the engine roar- I've tried the Dr. Dre's as well and the Bose QC15 is superior in this area.- As far as the fit and comfort go - i'm neutral, as I've not tried on too many other headphones like this- Why this review is 4 stars and NOT 5 stars: As far as the noise cancellation goes, they do not do a good job of cutting out voices or any other noise outside background hiss. This part of noise cancellation seems to be missing. Overall, the sound of people talking is far reduced when the headset is turned on, but without playing music, you can still hear people talking in the background, even if they aren't very loud.", "overall": 4.0, "summary": "Works well but not perfect in \"cancelling\" all noise", "unixReviewTime": 1364169600, "reviewTime": "03 25, 2013"}
{"reviewerID": "A3CD0377YGALLE", "asin": "B0054JJ0QW", "reviewerName": "DK", "helpful": [2, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I purchase other headphones (Beats, Sony, Soul) but quickly realized that I should have listened to what all the reviewers said about the Bose.  Just because the others are similar in price doesn't mean they are all the same.There are several variables in my decision.  1). The size of the case is much better when fitting into a laptop bag. The cases for the Soul and Beats were huge and not very flat.  The Bose is flatter by far.  2). Sound bleed was very bad on the Soul and the Beats and Sony.  If I sat next to someone while wearing these, they would not be happy because they could hear the sound too.  Not good for others. It seems the Bose are better about preventing sound leaks around the ear cups.  3). Comfort.  The Bose felt lighter on my head for extended periods of time although the others were not uncomfortable.  4).  Sound was more than fine for my needs on the Bose when listening to podcasts, audio books and music.  I suppose you might argue that the Beats or Soul are a tad better for music, but that might be true only for certain types of music.  Noise canceling function works extremely well on the Bose and imam writing this after having used them for several overseas flights.  5). Price.  Not as much a concern for me since the others i tried were similar  in price.Try them.  You'll keep and enjoy them.", "overall": 5.0, "summary": "Tried other headphones but kept the Bose", "unixReviewTime": 1369872000, "reviewTime": "05 30, 2013"}
{"reviewerID": "A1MW6YVUTA9FE7", "asin": "B0054JJ0QW", "reviewerName": "Doug", "helpful": [1, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "These are my second pair of Bose I've owned. I had the QC2 before this pair, and I can tell you, BOSE ARE THE WAY TO GO! The quality of music, every tap of a drum, ever breath the artist takes, is so crisp and sharp. You don't have to blare your music anymore to hear how good it is. The noise cancelling is great at cutting out chatter for people and particularly good at removing the rumbling noises from jet engines while flying and the road and engine noise while in a car or bus.Really though, I cannot recommend Bose headphones enough! I love them more than my 5.1 surround sound from my computer. In all seriousness, if you're willing to put down $300 on headphones, you'd be a fool to get anything other than these. There are some very small companies that have better systems, without the noise cancelling, but for more than twice the price, not to mention, if they break, that's on you. With Bose, I have had only one issue over the past 6 or so years of owning a product from them, and I can tell you that their customer support is phenomenal. Immediate replacement of my headphones, no cost to me. No questions asked.If you are willing to spend $250 - $450 on a pair of headphones, there is no better option in that price range than these QC15's. They are truly a remarkable piece of technology and I cannot stress enough just how great both the build and sound quality are.", "overall": 5.0, "summary": "Can not get better headphones than this!", "unixReviewTime": 1390694400, "reviewTime": "01 26, 2014"}
{"reviewerID": "A365BJAGU86XY8", "asin": "B0054JJ0QW", "reviewerName": "DP21", "helpful": [9, 10], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "Having used these headphones for three months i feel it is enough time to leave a competent review. I bought these headphones because everyone raved about the sound, comfort, and noise cancellation.SOUND: I want to start by saying i am a regular guy that likes music and radio. I am not a professional, an audio engineer or anything of that sort. Do these headphones sound good? Yes. Do they sound noticeable better than a cheap set of ear buds? Yes. Is it something that will blow you away and change the way you listen to music? Not really. In other words, these sound good and they are fun to listen to, but the way some people make it sound you would think it is astronomically better. They are not. There is one thing i have to say about these headphones, they are not good to listen with cell phones. I have tried them with a Samsung Galaxy S3, an LG G2 and an LG Optimus F3. The volume is not as loud as it should be. I like my music loud and these guys don't deliver in that aspect when you are using these with a cell phone. I hooked them up to my desktop and the sound is much louder and richer. It could be that the audio card on the desktop computer is better.NOISE CANCELLATION: One of the biggest plus in these headphones. The noise cancellation is awesome. It is amazing how much sound these guys block out. For the past six months i had construction making terrible noise outside my house. When I put these guys on i can't hear anything. Sounds like lawn mowers, drills, car engines and microwaves go away without any problems. It doesn't block everything though. For example, voices are only blocked marginally. Once you put the music at least half way you will not be able to hear anything. On more than one occasion i have missed delivery packages because of these. You are in your own world when you put these on with volume over 50%.PACKAGING: These headphones come in a pretty nice case that offers very decent protection. They fold flat on the case which makes it very convenient if you want to take it on the road in a backpack. Along with the carrying case comes two audio cables. They are fairly skinny cables that are considerably longer than your regular Apple ear buds. I really hate how the cable gets tangled very often with chairs or other objects when i am walking around the house using the cell phone.  One of the cables comes with volume control but it doesn't work with Android phones. The middle button pauses/continues the songs though. If you triple press it quickly it skips to the next song. I am surprised that the cable has held up so well considering i keep pulling and tangling it every day.CONSTRUCTION: I seen a lot of people bashing the construction of these headphones. The headphones are not made of indestructible metal, they are made of plastic. That is not to say that it is bad though. I have accidentally dropped the headphones from my hands to the floor in more than one occasion. The headphones are still intact. I also like that the headphone band is very flexible. A lot of time i like to only listen with one ear and place the other cup a little behind my ear. Like i said, it is flexible so it doesn't break or anything. The band on the middle is made of leather which makes it feel premium. Personally, i like it a lot. The only thing that has me worried about these headphones is the little door that opens up so you can insert the battery. It is also made out of plastic and i am afraid the plastic might get fatigued after a couple of years of use. The actual door that i am talking about is like the ones in TV remote controls that have the little snap sound once you close it. If it ever stops snapping correctly i fear it can stop the sound completely since the headphones do not work without the batteries. The construction could be improved but it is not nearly as awful as some other people make it out to be. If you treat them carefully they are going to last.COMFORT:  The plastic construction makes the headphones very light on the head. I have tried other headphones that weight considerably more and it just becomes painful to use after more than an hour. I bought the Beats by Dre Studios and i returned them after a couple of days because how heavy they felt. The size of the cups were small too. I had days where i used the QC15 for more than 4 hours in a row without feeling any discomfort. Actually, i will go ahead and say it, these are the most comfortable set of headphones i used in my life. If you want to use headphones for extended use, these are it. The cup size are pretty big and they fit my ears perfectly.BATTERY LIFE: I use a set of 1.2V rechargeable batteries to power these headphones. I use it an average of 3-4 hours a day. Each battery last me an average of 1 week. The right cup shows a blinking light that warns you a few hours in advance when the battery is running out. If you are planning to use the headphones a lot consider purchasing a set of rechargeable batteries. You will go through about 4 batteries a month. I don't think the 35 hour estimate made by Bose is accurate. I feel it is closer to 20-25 hours. But then again i have only tried them with rechargeable batteries.In conclusion, i like these headphones a lot. The only reason why i don't give them 5 stars is because they are very expensive ($300) and because they require the use of batteries. It would have been great if they could be used without batteries even if the noise cancellation didn't work. The sound is a considerable improvement over regular ear buds. The comfort and noise cancellation are the best i ever seen in a set of headphones. I have no problem recommending these headphones if you can stomach the high price though.", "overall": 4.0, "summary": "A complete unbiased review after three months of use.", "unixReviewTime": 1385078400, "reviewTime": "11 22, 2013"}
{"reviewerID": "A3QNCXNMG1ND0T", "asin": "B0054JJ0QW", "reviewerName": "D. R. Gendreau", "helpful": [7, 9], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I have been traveling a lot for the past 2 years and its literally been that long that I have been agonizing over this purchase.  If you are reading reviews you are probably in the same boat I was. $300 for head phones??  Its a tough one for sure.  Let me put it this way, even if you travel once a year its worth it.  Most trips I have taken I want to strangle someone, not sure why people are such retards when traveling, but I am just trying to get from point A to Point B.  The more you travel the more it gets amplified.  I could see where someone that can use these at work would be very happy with these too.  Bottom line is I wish I had bought these 2 years ago.I bought some cheaper noise canceling headphones from Sony (MDR-NC7) and I have some decent in ear headphones from Sony also.  The in ear block out as much noise as the noise canceling ones so the noise canceling ones from Sony where a waste of money.  Not only do they not perform the noise canceling function very well they also sound very weak.  Now keep in mind that I am comparing $40 headphones with $300 ones.  I never expected the $40 ones to do as good as the Bose but seriously, if you just get some cheap in ear head phones you would be just as well off.Noise Cancelation:The test at Best Buy with specific noise (Jet noise simulated) at the Bose display is astounding to say the least.  I agree with several other reviews that the Bose head phones seem to pick particularly easy frequencies to block and it is most certainly aimed at lower range.  I first tried these while watching a rather loud movie and I felt that gave me a much better representation of what to expect in an airport or airplane while traveling.  Most noise was blocked and the voices where lowered a great deal, with music at medium levels most of the noise was blocked out.  From what I read on the Bose website there is a Mic on the outside AND the inside of each cup.  You can read up on the specifics, I can tell you that it does a very good job.Sound Quality:I saw several complaints in reviews about the sound and all I can say is its Bose.  I have a Bose stereo in my car and immediately had to replace the speakers.  I totally expected the same mediocre sound quality with the headphones.  Decent sound that is brought to you from the cheapest drivers they could get away with.  Profit driven?  You bet.  Unfortunately with headphones there is not a darn thing you can do about it.  Personally I am happy with the sound but know I should be getting a \"Little more\" for my $300.  Because of the noise canceling you don't have to cut the volume up as high as you would without to hear details as clearly.  For me the overall sound is very good but its no Dr. Dre's either.Construction Quality: ****Update below \\/ \\/ \\/ *****I have not had these long enough to know about defects or short comings.  I appreciate the fact that the head phones come with a decent case and I think the overall feel is ok.  I have seen a few people ram these into the seat back while on a plane and a back pack before, I suppose these are the people complaining about the head phones falling apart.....imagine that.  I understand how someone paying $300 for head phones and having it break right away could be frustrated but take that with a grain of salt.Package includes:Head Phones (Can be used without a wire for just noise cancelation)Semi-hard Shell caseWire for regular mini plug connection wth High/Low settings for Airplane adapter useWire for Iphone/Ipod/Itouch use (Has same features as OEM Apple ear phones, i.e. volume up, down, pause buttons and built in mic)2 prong to 1 Airplane Adapter1XAAA Battery (MAKE SURE YOU PACK A SPARE AAA) you can not use the headphones to listen to music with out a batteryWarranty bookInstructions in many languagesUPDATE ######  07-05-2012  I have had these headphones long enough to add additional comments on the construction quality.  I strongly urge people to use the semi-hard shell case to carry your headphones.  I took one trip that I had very limited room to carry my case so I left it in my luggage.  I will never do that again.  I see clearly now how people break these while traveling.  Its not practical to wear these the entire trip especially when its 100 degrees outside and parked in a plane for an hour on the ground, this exact situation happened to me so I put them as gently as I could in the seat pocket but I almost broke them taking them out.  Just bring the case and deal with it.  Keep in mind you are buying cutting edge technology headphones that sounds decent and cancel a majority of outside noise....not indestructible headphones.  They are not butterfly wing fragile but I could not see a single failure point either that would have me overly concerned.Since my purchase Dr. Dre has come out with noise canceling headphones for about the same price.  Personally I would buy those instead after listening to them but all in all I am still happy with my purchase.  By far the best money I ever spent for traveling.  My last trip there was a totally annoying child screaming his lungs out and all I could do is put my headphones on before take off and cut them on (I could care less when the flight attendant said)  I played music at the highest clear volume and was smiling away as I looked around and saw one after another passenger's face filled with disgust and aggravation.  The trick is to point the LED AWAY from the flight attendant side and just tell them it is off and they will leave you alone.  To be clear, the highest undistorted volume on this headset is probably 60-70% of the Dr Dre's.  Good thing is it can drown out pretty much anything.  Another good thing is you did not have to have it at unsafe levels for total sound blockage.", "overall": 5.0, "summary": "Sanity saver a must for travelers; Bose vs Sony MDR-NC7", "unixReviewTime": 1317945600, "reviewTime": "10 7, 2011"}
{"reviewerID": "A1A6C30655N426", "asin": "B0054JJ0QW", "reviewerName": "Edward Stevens \"Steve\"", "helpful": [1, 2], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "This is Mr. Skeptical here... I almost over-thought this item because to me it seemed a little pricey, I am retired and on a fixed income. These Headphones do everything that you had hoped for them to do. Big time noise reduction and a great headphone. You can use them for noise reduction only if that is what you want, but they make my MP3 player sound great. Definitely a quality product.  Your turn to \"step up\"...", "overall": 5.0, "summary": "The One You Have Been Looking For...", "unixReviewTime": 1341273600, "reviewTime": "07 3, 2012"}
{"reviewerID": "A2BA12Q8H0H9AF", "asin": "B0054JJ0QW", "reviewerName": "EPHiCS", "helpful": [5, 7], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I also wanted to try out some noise cancelling headphone so I headed to my local store and tested out these BOSE and a pair of BEATS. They both sounded good but I felt that the BOSE was a little clearer and the build quality was better. I decided to order them on Amazon because they got the best price. ^_^ I got the headphones today and decided that I must write a review for a product this good.I put the headphones and turn the noise cancelling button on and honestly I wasn't impressed. I thought I wasn't gonna hear the background noise with the noise cancelling on and the audio jack disconnected. It seemed like everything was filtered and all I could hear was my TV playing. Anyways, I just added this because I wasn't impressed at first.Later at night, I turned the headphones and plugged it into my ipod. I have to say that it I was very impressed with the audio quality. The sound was incredibly clear. I loved the vocal quality when listening to new Bon Iver CD. I wasn't expecting the headphones to have a lot of base because there Acoustic headphones but the base is damn good. I have to say that the headphones can bump when your listing to rap music. I mostly listen to Alternative, Rock, Rap, and Reggae and these headphones sound perfect on every genre that I tried it out.The only negative thing I can find is that my ears will sweat so I usually take the headphones for a little after an hour or two of listening to music. Other than that. These headphones are solid build and the sound is crisp and clear. Owning these headphones makes me want to re-listen to my whole music library again.", "overall": 5.0, "summary": "The Clearest Count I EVER Heard", "unixReviewTime": 1310515200, "reviewTime": "07 13, 2011"}
{"reviewerID": "A1PQLR0EN31PE8", "asin": "B0054JJ0QW", "reviewerName": "E. Smith", "helpful": [2, 3], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I am on my second set, just because I wanted to get a second set.  I have own these for awhile now.  Amazon didn't use to sell them, but I glad they do now.  My main. main, main reason I got these is because I tend to be a little rough on headphones (by accident) and I got tired of paying $30-40 and having shoddy headphones.  I am reviewing this not because of it's noise cancellation but it's ability to let you listen to crystal clear sound.  Love it.  I listen to my iPhone/iTouch with these.  And the sound is incredible.  You hear all the bass, trebles, horns, rich voices you really want to hear.  It makes the music very very personal as if you are in the world's best concert.  I also use them on my home theater and wow, it brings the base and distributes the sounds as if you are listening to it in surround sound.  I also used them on my computer and it sounds great also for gaming, tunes, etc.  Plus, there is a microphone accessory so if you get a call, you can speak to the other person and trust me, wearing these while using your iPhone, you will never mistake another word.And they are extremely durable.  Many times I have fallen asleep wearing these or I get a little entangle and the cord just pops right out of the headphones (designed to do that), so no more frayed or torn wires where you can only hear one side.  It is practically impossible to damage that cord from it getting caught on something.  The only tiniest drawback is that it runs on batteries (one single AAA), but that doesn't matter.  It is soooo worth it.  I normally get the Energizer Lithium/Ultimate batteries (silver color).  A little more expensive, but they last longer than just generic AAAs.  There is an on and off button on the side (the noise cancellation button), so you can always turn it off to save battery (when you aren't using it).  Also there is no noise leakage from these when you are wearing them, so you will not be disturbing your fellow citizens.Oh and I do wear these when I am flying (normally listening to music) and they shut off the entire world.  Makes it a more pleasant flight.I also want to say something about the noise reduction aspect of these headset.  It works.  It may not block out all the noise, but it blocks out a good portion of it.  I think they are better design than Dr. Dre the Beats (the other $300 headphones).  Listen, $300 dollars is a lot for headphones and I thought I would never ever be that person that would spend that type of money on something like this, but it is soooo worth it.", "overall": 5.0, "summary": "Best headphones I've ever owned.", "unixReviewTime": 1333670400, "reviewTime": "04 6, 2012"}
{"reviewerID": "A2I7VB5N0FLNBD", "asin": "B0054JJ0QW", "reviewerName": "evilmaniac", "helpful": [6, 8], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I had the predecessor of this product and frankly although the build quality seems to have improved as-well as the weight of the product (feels less flimsy); The same could not be said in terms of audio quality which seems to have decreased. The noise cancellation abilities are better however and many background sounds that used to leak into the previous model no longer do so.*edit* Although I also own the Bose MIE2 Mobile headphones (for over a year now) which work with both Android and iPhone; the microphone that comes by default with the Quietcomfort 15 does not work with my Android even though it works with my laptop (which is not a macbook). This might be an issue with my phone (I will update once I look into it further).*edit* Bass is definitely worse than predecessorConclusion: Total disappointment from predecessor; This is by far the first product I have not enjoyed from Bose. Feels like a downgrade rather than an upgrade.", "overall": 2.0, "summary": "Better than before", "unixReviewTime": 1368316800, "reviewTime": "05 12, 2013"}
{"reviewerID": "A2W0GY64CJSV5D", "asin": "B0054JJ0QW", "reviewerName": "FreeSpirit", "helpful": [784, 850], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "I decided to cheap out earlier and bought a pair of Sony NR headsets for $30 and change. They seemed pretty good but on flights, the NR wasn't good enough - way too much background noise. Finally I decided to man up and get the real deal. And boy, what a change (for the better)!With the Bose headsets, NR means NR, they ain't kidding about when they say NR, absolutely no background noise on the flight. My quick thoughts on this so far:- You haven't heard true HD sound if you haven't heard it on this headset.  And the sound is not like bass or treble heavy, it's just crisp and you can hear every water drop and every single instrument being played. And NR works great both ways on this headset - the surrounding noise is almost cancelled out completely for you when you're using the headsets, and the sound of the sound from the headset doesn't carry out of the headsets either. I can listen to music or movies at a fairly high volume and the person sitting next to me won't hear a thing.- The leather trim around the headsets makes them extremely comfortable to wear. I wear them on 15-hour flights and don't feel any strain by the end of the flight. My ears or head don't hurt because of the headsets and the plastic strap. They truly are made for comfort.- It comes with airplane adapter so you can turn it from a single 3.5mm audio cable into one that fits in the airplane sockets. The cable is also detachable completely from the headset, which I actually find very useful when I want to doze off and not be bothered by surrounding noise. You don't realize how effective the headsets are till you take them off and realize how much of background noise they were eliminating!- The only one downside of this headset is that it runs on a AAA battery. So I always need to make sure I have fully charged batteries with me at all times. I carry rechargeable batteries (Sanyo Eneloop are the BEST) with a charger. So if I do run out of battery, I can always charge it on the flight itself. ON a full charge of the Eneloop AAA,  I am yet to run out of battery on a 15-hour flight.Yes, these headsets aren't cheap but they are worth every penny. Bose puts so much research and effort into developing their products, I have absolutely no reason to complain!", "overall": 5.0, "summary": "The BEST NR headsets - period", "unixReviewTime": 1317081600, "reviewTime": "09 27, 2011"}
{"reviewerID": "A1XF06AFGMTOV6", "asin": "B0054JJ0QW", "reviewerName": "Gadget Geek \"David\"", "helpful": [1, 6], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "These headphones distort at high volumes and sound flat when using for playback in a recording studio.They barely reach a satisfactory high volume level when listening to music on an iPhone or iPod.  Even with the high settings on the earphone plug that jacks into the earphone.Noise canceling works well for wanting some quiet while reading.Beats by Dre studio sound incredible on iPhone, iPod and via playback through sound card in my home recording studio, however they too distort but only at the 8 -10 max range on volume; they have a fuller sound from 1-8 volume setting (low to three quarters of the way up)The Bose are comfortable and clear but the clarity and sparkle just isn't there as they are with the beats by dre studios.I'm still a big fan of Bose (surround speaker system) but they need some improvements in tuning these headphones for better sound.", "overall": 3.0, "summary": "Ok but not better than Beats by Dre Studio", "unixReviewTime": 1320710400, "reviewTime": "11 8, 2011"}
{"reviewerID": "A10UT1WJKGPCH9", "asin": "B0054JJ0QW", "reviewerName": "Girotek", "helpful": [2, 3], "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones", "reviewText": "The headphone is more than what I expected, excellent sound quality, real noise canceling, conformable on the ears, great value.", "overall": 5.0, "summary": "Graet Sound", "unixReviewTime": 1329177600, "reviewTime": "02 14, 2012"}
{"reviewerID": "A108R4YWV3EADS", "asin": "B00BCGRZ04", "reviewerName": "Aggie \"country girl\"", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "For a small TV it really surprised me.  The picture is great and it meets all my expectations.  This is my first HD TV I have purchased for my home.  With a special box from Charter it even gives me the channels that are scrambled by Charter unless their box is attached.  It was a  very easy setup and all instructions were clearly spelled out.  I recommend this purchase.", "overall": 5.0, "summary": "A nice little HD TV", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
{"reviewerID": "A1LWI79T0838UL", "asin": "B00BCGRZ04", "reviewerName": "Amazon Customer", "helpful": [138, 147], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "There aren't many major brand Flat Panel TVs that will fit under the upper cabinet in your kitchen. We have 2 other Samsung TV's in the house and are very happy with them.  It was a nice surprise to find this model for our kitchen.  Its also nice to have the same remote control design in 3 rooms.  The picture is great and the sound is pretty good for the small speakers facing down from the bottom edge.A year ago we bought a 22\" Visio for the kitchen.  It fit because it has no stand to increase its height.  The sound on the 22\" Vizio was poor . . often hard to understand speech on some programs with the Vizio.The TV is very light weight.  To allow the TV to turn on the granite counter, I removed the sticky rubber feet and put on felt pads available at hardware stores for chair feet. The felt pads are very slippery so you can spin the TV with a finger tip.Two Minor shortcomings for our needs:1. TV has only 1 HDMI input. Our primary program source is HDMI, but with Amazon-Prime and NetFlix subscriptions we also ordered a RoKu3 module to play Amazon/NetFlix programming to this TV. It would be nice not to have to use an external HDMI switch.  (We just discovered RoKu - its the competitor to the Apple TV module, but usually considered better than Apple TV unless most of your other gadgets are also Apple)2. This TV has an external power block like your notebook computer.  On our Peninsula kitchen counter, we turn this TV to face the Kitchen or Dinette. It would be nice to not have this power block to hide.  Being compulsive about tidy electronics installations, I lengthened the low voltage power wire on the power block and placed it in the unfinished basement below the TV. Now we only have the thin black low-voltage power wire going into a wall plate along with the HDMI feed from the basement. The DishTV and Roku remote controls are both Radio-Frequency so the DishTV HDMI-module and RokU-Module can be in the basement below the TV.Overall, we are really happy to find this great TV that is only 12.5\" tall with the stand.  If you really need 2 HDMI inputs and are OK with the higher price, look at the 19\" Toshiba TVToshiba 19L4200U 19-Inch 720p 60Hz LED TV (Black)", "overall": 5.0, "summary": "Great TV - Fits on kitchen counter under the upper cabinets", "unixReviewTime": 1364947200, "reviewTime": "04 3, 2013"}
{"reviewerID": "A2YW86IZE9PN2C", "asin": "B00BCGRZ04", "reviewerName": "Ancient Mariner \"Grandpa C.\"", "helpful": [11, 14], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "For general home use, as we do in the kitchen, this TV provides a decent-enough picture and adequate sound for the casual or passive viewing and listening experience that it is being used for.  It is very economical to operate considering its 12-volt DC power supply.  It is very compact for use on the kitchen counter and below cabinets.  However, the only negative is that with the need to use the power adapter, plus make cable connections from the source to a digital box and then to the TV, there's a lot of cables and wiring to try and conceal when sitting on a relatively-open kitchen cabinet.  A more simplified or condensed power supply with less cords/wires would be more appealing.", "overall": 5.0, "summary": "Great Economical Little TV", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}
{"reviewerID": "A3EQQHWJ1EEYEU", "asin": "B00BCGRZ04", "reviewerName": "Burt Bicksler", "helpful": [27, 34], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "When the ancient CRT based TV in our guest room expired I was looking for a good replacement.I checked locally and no one had a good name brand smaller LED / LCD TV.  There were a few off brand models, or I could order one at a local store.This TV was at a really good price point for a Samsung.  Not much more to say.  Worked great out of the box.  Setup was very easy.Picture quality is excellent.  Sound quality is good enough for its intended purpose.  Can't say about the HDMI inputs as we don't need those at this time.I would recommend this TV if you need a smaller format model.", "overall": 5.0, "summary": "Great TV at a good price", "unixReviewTime": 1368662400, "reviewTime": "05 16, 2013"}
{"reviewerID": "A2H5LR3VHM0TIY", "asin": "B00BCGRZ04", "reviewerName": "C2000", "helpful": [2, 17], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I got this for the headphone jack, but I really don't like the TV. It has no real cord. The cord has a somewhat bulky detachable AC adapter, which I don't like. The TV is too short like many LED TV's and not easily tilted downward toward my bed. Base is too small. Doesn't seem slim. Reception poor. The red light is on the right bottom side and not the center. I would never buy any Samsung TV for my bedroom ever again, unless it was the only headphone jack TV on the market.", "overall": 3.0, "summary": "might be ok for certain situations", "unixReviewTime": 1368230400, "reviewTime": "05 11, 2013"}
{"reviewerID": "AQ831E972J4VI", "asin": "B00BCGRZ04", "reviewerName": "cyberrat", "helpful": [3, 5], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "the stand that comes with the tv is a cheap plastic and it hard to connect to the tv.  nice little tv though but due to the stand I give this a two star because the stand is a pretty important part", "overall": 2.0, "summary": "Come with a worthless little stand", "unixReviewTime": 1386460800, "reviewTime": "12 8, 2013"}
{"reviewerID": "A3AXRCFF9KH3QW", "asin": "B00BCGRZ04", "reviewerName": "david", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "This TV is OK. Good sound. But the color is just kind of off and I can't get it to look great after lots of adjustments.Also, there is NO AUDIO INPUT which was a giant disappointment", "overall": 2.0, "summary": "Color quality not great.", "unixReviewTime": 1399075200, "reviewTime": "05 3, 2014"}
{"reviewerID": "AMIR3CC4R3RSE", "asin": "B00BCGRZ04", "reviewerName": "Dianne Averill \"Dianne\"", "helpful": [8, 10], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Yes, all previous reviews are true. Nothing wrong with this tv except the cheap stand that's very difficult to put on.", "overall": 4.0, "summary": "Good except for stand", "unixReviewTime": 1376611200, "reviewTime": "08 16, 2013"}
{"reviewerID": "A1SM9DMAN5WSLI", "asin": "B00BCGRZ04", "reviewerName": "D. Navarre", "helpful": [2, 3], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I bought this for one of my work rooms. It sets on a shelf above the work bench. Since the stand is not adjustable, the TV has an option on the menu to choose a \"Lean Back\" setting that adjust the viewing angle so you can get a good picture even viewing from below the TV. It also has a \"Standing\" option.I'm just hooked up to a cable so I can't comment on any of the other input features.Cons:I do wish it had a \"Favorites\" button on the remote to let you advance through your favorite channels. To view your favorite channels you have to go through menu options each time.There is supposed to be an option for the TV to adjust the brightness automatically based on the light in the room but for some reason I can't activate that feature. The option is gray, non-selectable.", "overall": 5.0, "summary": "Great picture and sound.", "unixReviewTime": 1376265600, "reviewTime": "08 12, 2013"}
{"reviewerID": "A3AX6U698PAQAV", "asin": "B00BCGRZ04", "reviewerName": "Duracell", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Saw others complaining about the base. Make sure to use the screws provided to connect the base to the TV otherwise it will be extremely wobble-y! I think that's probably what happened to the other owners.Working well so far. Had it 2 weeks. Bought to replace an old CRT TV  with glitchy volume that I had in my room. Sound is much better, and it doubles as a second monitor for my Laptop using http://www.amazon.com/AmazonBasics-High-Speed-HDMI-Cable-Meters/dp/B003L1ZYYM/ref=cm_cr-mr-title to connect. Confusing to use headphones on because it will switch between using the computer speakers and the TV speakers for audio, but can be figured out using trial and error.", "overall": 4.0, "summary": "Clear display and easy to set up.", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
{"reviewerID": "A1RFHS01PD3CY4", "asin": "B00BCGRZ04", "reviewerName": "Dwayne S. Daughtry", "helpful": [5, 6], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "my mom wanted a TV in her bedroom. I looked for a few weeks around stores but didn't seem to find the right one. My mom is older and does NOT like new technology because it seems confusing. I cannot blame her way of thinking.The initial setup was all too easy. In fact, the TV does it all for you. Even puts the name of the TV station in the channel selector for you. No more manually entering TV call station identifiers.The picture screen is actually very impressive for 720p. Small and light enough to set on a wooden dresser without fear of imprints on the finish. Very good sound quality. Remote is simple for any age. I highly recommend for the price and quality.", "overall": 5.0, "summary": "Great quality and price!", "unixReviewTime": 1386115200, "reviewTime": "12 4, 2013"}
{"reviewerID": "AK5SUC6HADAVZ", "asin": "B00BCGRZ04", "reviewerName": "E. Bernardino \"Addicted to the Gold Box\"", "helpful": [15, 19], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I received this Samsung 19-inch HDTV yesterday via next day Saturday delivery. It was purchased to replace a small, older portable set in my sunroom, that of which I finally resolved to replace after much hesitation (my motto; if it ain't broke, don't fix it!). I had opted for a Samsung, as my kitchen set is also a Samsung (albeit a costlier 19-inch model HDTV), and I have been very pleased with the performance of that set. Additionally; I own a Samsung Galaxy Tab (tablet), for which there is a \"Peel\" Smart Remote app that allows one to control the channels and volume of any Samsung TV. It also provides detailed program information by category which is very nice to have at your fingertips!The set is very light and easy to set up; 3 screws in the bottom to attach the fixed base, and you're good to go...simply plug the cable into the rear of the set and plug the set into an outlet. Once you turn the TV on, programming instructions will appear; use the fast start guide as a reference. The set will auto-tune your cable provider's channels (I have Verizon FIOS), and you can either manually set the color, contrast, ratio, etc. or utilize the factory preset.As the base is not extendable, I would suggest eye-level placement (the TV has an interesting \"tilt\" feature to compensate for non-eye level placement); I have mine set up on an attractive pedestal (which is actually a plant stand!), and that provides an ideal platform for eye-level viewing.I do wish to add that this particular TV of mine is NOT connected to High Definition broadcasting (I already have 2 HDTV sets that I utilize a bit more often than this one, and am already paying Verizon enough for those set-top boxes and their monthly service in general:), so I maintain a basic \"box\". Nevertheless; I am still very impressed and satisfied with the reception.I am very pleased with this set and consider it a wonderful value for the money.", "overall": 5.0, "summary": "Very nice set for the money!", "unixReviewTime": 1368921600, "reviewTime": "05 19, 2013"}
{"reviewerID": "ATDIG2XB9DTE4", "asin": "B00BCGRZ04", "reviewerName": "GC", "helpful": [2, 2], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Bought this from the Amazon Warehouse. It did not look quite like the set pictured. The frame around the screen on the one I received is much thicker than the photo from Amazon. Picture is good, sound is very good and the remote responds great. We use this on a bracket in the kitchen. It sits on the supplied base which was not a problem to set up except Amazon forgot to send the screws to do so. Luckily I had some that worked perfectly. There was some wear on the face of the frame that made it clear that this was not a new TV. Some careful polishing with some compound paste brought it back to looking new. The wear scratches may have been the result of improper repackaging.", "overall": 4.0, "summary": "Nice TV", "unixReviewTime": 1394150400, "reviewTime": "03 7, 2014"}
{"reviewerID": "A1RQ9MGHZ2E3FF", "asin": "B00BCGRZ04", "reviewerName": "hc \"h\"", "helpful": [3, 5], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "By far the best picture overall I have ever seen in a small counter top HD LED TV.  Highly recommended.", "overall": 5.0, "summary": "Great Picture and excellent contrast.", "unixReviewTime": 1379635200, "reviewTime": "09 20, 2013"}
{"reviewerID": "A3IUWI190QCH10", "asin": "B00BCGRZ04", "reviewerName": "HTMaven", "helpful": [2, 2], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "This TV is pretty good. It is a 4000 series so it isn't a high end set, but in this size, there is no high end set. The picture is decent and the sound is better than I expected. In all honesty you won't get a better picture in the 19\" size class than this. I had to mark it down because of an issue that most likely not affect many others.That issue is:I used an under cabinet mount to mount this underneath of a top bunk bunk bed. (I am a little nutty) The mounting holes on this set are very high up on the back of the TV. Other sets in this size have the mounting holes at about the middle. Because the mounting holes are so high you can't get the TV very high up on the mount. That really annoys me because it causes the TV to sit a few inches lower than other sets, which in my case takes away from my legroom. I was considering an Insignia which would have worked better, but the picture of the Samsung is superior.", "overall": 3.0, "summary": "One flaw", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
{"reviewerID": "A1M5MVOW5J9CGL", "asin": "B00BCGRZ04", "reviewerName": "Is it So who knows \"Opinion Oky\"", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "The picture quality is good and the volume and audio is excellent. What stinks is the stand it comes with. I'm using the stand but have bought a wall mounting bracket.  Whats with the stand?", "overall": 4.0, "summary": "Very Good", "unixReviewTime": 1390089600, "reviewTime": "01 19, 2014"}
{"reviewerID": "A3QDPQBJAJC6C", "asin": "B00BCGRZ04", "reviewerName": "Jaco", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Good: Price, Amazon 2-day shipping, very low power consumption, easy programming, lighted remote, very lightweight, fast volume adjustments.Not so Good: Picture (it is fine for some, but not a fan of LED technology), sound (literally sounds like the cheapest of cheap speakers ever made)Overall: Good purchase. I bought a pair of computer speakers and hooked it up to the 1/8&#34; earphone/audio jack. Problem solved. Since it is a kitchen TV...not too concerned about perfect picture quality. Put a Wattmeter on the outlet to see how much power is being consumed by the TV and speakers...18 watts. Pretty darn good!", "overall": 4.0, "summary": "Does the job", "unixReviewTime": 1391472000, "reviewTime": "02 4, 2014"}
{"reviewerID": "A1FSA9SFOKAXGQ", "asin": "B00BCGRZ04", "reviewerName": "J. Arnold \"jim18170\"", "helpful": [10, 14], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "The TV started cycling when turned on and would not display a picture. I liked the ability to play avi and .mov files on it so I'm getting a replacement unit and hope this one is not a lemon. Will try and report back in a few months on the replacement unit.", "overall": 2.0, "summary": "Died after a few weeks", "unixReviewTime": 1372723200, "reviewTime": "07 2, 2013"}
{"reviewerID": "A2OMYVABXZVCA8", "asin": "B00BCGRZ04", "reviewerName": "J. Holman", "helpful": [4, 6], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "It's hard to find a small TV with decent picture quality, and this 19 inch Samsung is about as good as it gets in that respect. I bought it mainly to use while walking on my treadmill, where I'm looking at the screen from a couple of feet back. I'd actually have preferred a 15 or 16 inch TV for this purpose, and I also own a current model, 16 inch Viewsonic that I could have used. But the Samsung's picture is way better; the Viewsonic is washed out by comparison, and if you're not directly in front of the Viewsonic, it gets worse. This seems to be a problem with 15-16 inch TVs in general, based on other reviews on Amazon. Off axis viewing is better, if not ideal, on the 19 inch Samsung. So I can also watch it from across the room when I'm not on my treadmill, as long as the viewing angle isn't too extreme. (Side viewing is better than looking up at it, which makes the picture go dark -- so if you plan to mount the Samsung on wall, get a mount that's easy to tilt).I'm also pleased that the controls and user interface seem logical and straightforward -- though that could be because I own a couple of other Samsung TVs.The sound is about what you'd expect from a TV this size: acceptable, and certainly better than the 15-16 inch models deliver. But most of the time, I'm using the Samsung to watch something off my Roku box, with the sound connected from the Roku to an audio system. The Samsung also offers more in and outs than most small TVs, so there are a variety of connection possibilities.To sum things up: There are a lot of places where a TV this size is the ideal choice, and among the rather few offerings available, this Samsung stands out.On my wish list: I wouldn't have minded paying an extra $50 or so if Samsung had managed to include some \"Smart TV\" features, at least Netflix, Pandora, etc. But it appears Samsung doesn't offer these features on any TV smaller than 32 inches. That's a shame, because if you think about it, the places where you'd want a small TV (kitchens? bathrooms?) are probably the very places where you don't want several pieces of equipment and a tangle of cables. Even though the Roku interface is better than the comparatively sluggish \"Smart TV\" features on one of my larger Samsung sets, I'd have rather not had to dangle the extra cables off my treadmill to connect a Roku box. A smaller TV with Netflix -- and wifi -- would make perfect sense. Are you listening, Samsung? (Vizio makes one, though admittedly, it's 24 inches -- I might have bought it if it were smaller.)", "overall": 4.0, "summary": "Best choice where a TV this size makes sense", "unixReviewTime": 1376438400, "reviewTime": "08 14, 2013"}
{"reviewerID": "AGYC72Z4M6BDS", "asin": "B00BCGRZ04", "reviewerName": "John Curtis \"jgcurtis\"", "helpful": [2, 3], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I haven't checked out anything beyond HDMI input mode. Setup easy and has the right bells and whistles including &#34;Clear Voice&#34;.Attachment of base difficult without a holding Philips driver of the correct size. I had to tighten the three base screws to the point where the drive X felt nearly stripped. Until really tightened, base was floppy and unsuitable.I never could find Samsung model to program DirecTv remote for TV volume, etc. Anyone know how to do it?Very nice picture, sound acceptable for this size TV.", "overall": 5.0, "summary": "Just what I wanted. Base attachment aside.", "unixReviewTime": 1372291200, "reviewTime": "06 27, 2013"}
{"reviewerID": "AT09WGFUM934H", "asin": "B00BCGRZ04", "reviewerName": "John", "helpful": [5, 6], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Had to get rid of the last analog TV in my house which was a 19&#34; old square one. 4:3 channels are a bit smaller but 16:9 really fills up the screen. I don't need full hi def at this size, neither should you. Small amount of setup was needed to deactivate a sound that indicated turning on and off of the tv (new feature that NO ONE will like). Other than that it's a great Samsung product as usual. Easy to use remote lights up with CC and Sleep 1 button away. Great Bedroom TV.", "overall": 5.0, "summary": "Great Little TV Replacement", "unixReviewTime": 1382054400, "reviewTime": "10 18, 2013"}
{"reviewerID": "A1LYCQCJK2JWQ7", "asin": "B00BCGRZ04", "reviewerName": "Karl Carpenter", "helpful": [2, 3], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "The Good:Picture quality is what I expected, though black seemed a hair on the grey side. Colors were good. Vibrant and Bright.Sound Quality was more than acceptable.A lot of people have complained about the stand not being sturdy. I did not have that problem, though getting the screws in correctly could be a little difficult if your screw driver is not magnetic. The slot for them is deep and I couldn't get my fingers in them to get them started.Could be better:Power On time is a little slower than I would like ~10 seconds to get a picture.I don't really like the &#34;joy stick&#34; style control on the back of the TV, it feels awkward to me.Only one HDMI port - Yes I am aware this is listed but they could have put just one more in.All in All:Yeah, I'd buy it again.", "overall": 5.0, "summary": "Great little TV for the kitchen or extra bed room", "unixReviewTime": 1378252800, "reviewTime": "09 4, 2013"}
{"reviewerID": "A12OJMP1DVDWNO", "asin": "B00BCGRZ04", "reviewerName": "L. Hruska", "helpful": [10, 12], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "purchased for my parents, along with cheetah wall mount.works perfectly with OTA signal, great picture and acceptable sound for a tv this size.for the price, really can't ask for more.  would purchase again.", "overall": 5.0, "summary": "perfect bedroom tv", "unixReviewTime": 1373846400, "reviewTime": "07 15, 2013"}
{"reviewerID": "A2ANUZS8OB03X6", "asin": "B00BCGRZ04", "reviewerName": "liljohn", "helpful": [3, 17], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I like it but it was to small for me I thought it was bigger. gave it to my lil girl so she can watch tv on it. nice picture hd", "overall": 3.0, "summary": "to small", "unixReviewTime": 1375315200, "reviewTime": "08 1, 2013"}
{"reviewerID": "AQIEN3BHQFFQ", "asin": "B00BCGRZ04", "reviewerName": "Marc O'Polo", "helpful": [14, 16], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I have rated this unit four stars only because of limited use so far. I fully expect this to be a 5-star purchase.I needed a relatively small flat-panel TV for a guest bedroom. I have a Samsung LCD in my family room and have been pleased with it. (No problems so far after five years of use.) Consumer Reports and reviews here on Amazon steered me once again to Samsung.This 29-inch model was a snap to unpack and set up. The stand is sturdy; it's held in place with self-tapping screws. I make sure to cinch down each screw as I proceed; I find this avoids problems down the road.The unit is plug-and-play. Connect it to a power outlet and a cable jack. Power it up, and it goes into an interactive guided process for setting the various parameters, including scanning for available channels.After the plug-and-play process was complete, I tweaked a couple of the settings through the menu to satisfy my preferences for screen brightness and sound quality. As with any LCD TV, sound quality leaves a lot to be desired. But I find this unit is adequate for the location in which I've placed it and the somewhat limited use it will be receiving.", "overall": 4.0, "summary": "Fine unit for a guest bedroom", "unixReviewTime": 1378425600, "reviewTime": "09 6, 2013"}
{"reviewerID": "A1SRLXKU1PX3E6", "asin": "B00BCGRZ04", "reviewerName": "mcoliver", "helpful": [1, 2], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Mounted it on an arm in the kitchen so my girl can watch Jeopardy while she cooks.  fits under the cabinet and has a DC power supply that I velcroed to the back so that it swings with the TV.  This TV has DUAL HDMI inputs as opposed to many of the reviews online that state it only has 1.  Also has a coax that I hook into my HDTV OTA antenna on the roof to pull in 130+ digital channels for free.Please note that the VESA 75 mounting holes are near the top of the TV which means you need to allow for an extra few inches of room with most hinge mounts.  I did not have enough on my countertop so I opted for a horizontal arm style mount.", "overall": 5.0, "summary": "Kitchen", "unixReviewTime": 1383091200, "reviewTime": "10 30, 2013"}
{"reviewerID": "A38O1BU9JPFYK0", "asin": "B00BCGRZ04", "reviewerName": "Michael Collins", "helpful": [1, 2], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Love this little TV. I received it for free as part of a promo when I purchased their flagship 51 inch top of the line Plasma TV. That being said, it can't compare to that one and it shouldn't be. I threw this TV into a den until we get a larger TV in there, then this will move to a bedroom. I am impressed with the picture quality and especially the speakers. For under $300 in a small room this TV works great.", "overall": 5.0, "summary": "Perfect for a small room", "unixReviewTime": 1385251200, "reviewTime": "11 24, 2013"}
{"reviewerID": "A1WD0MNT2CQEHZ", "asin": "B00BCGRZ04", "reviewerName": "Mike B", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Samsung products are affordable and are of good quality. Got this for my RV, put it on a swivel mount and love it. Would buy this product again.", "overall": 5.0, "summary": "Good quality product", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
{"reviewerID": "AEYG1U7ILRM2W", "asin": "B00BCGRZ04", "reviewerName": "Mrs. Pat Englert", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "It may be because of my advanced years, but I had to get a sound bar to hear the TV perfectly.  Then, I got a universal remote to avoid the four I was using.  That is why I gave the TV 4 stars instead of 5, because I am well=pleased with the picture and the TV. in general.", "overall": 4.0, "summary": "TV great, except for minor adjustments", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A3H770QF760S40", "asin": "B00BCGRZ04", "reviewerName": "MW \"optional\"", "helpful": [1, 2], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Nice high quality TV with plenty of inputs.  Samsung as usual is one of the leaders when it comes to television", "overall": 5.0, "summary": "Another nice Samsung product.", "unixReviewTime": 1383696000, "reviewTime": "11 6, 2013"}
{"reviewerID": "AWP5F6CCNM1LZ", "asin": "B00BCGRZ04", "reviewerName": "paulicious21", "helpful": [3, 3], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Its an awesome TV! Perfect for our entertainment center. We needed a new TV and were not looking into getting rid of our entertainment center. This TV was just big enough to fit. The picture is beautiful. I don't know what 1080p looks like but coming from an old tube TV I probably wouldn't know the difference. My only complaint is that it doesn't have an audio out. But considering the limitations we had this was the best there is. I would recommend this product if you don't care about the audio out. It does have a mini headphone jack.", "overall": 4.0, "summary": "Awesome!", "unixReviewTime": 1386460800, "reviewTime": "12 8, 2013"}
{"reviewerID": "A18YMSP0D4QKE4", "asin": "B00BCGRZ04", "reviewerName": "Paul R. Steel \"pabloinla\"", "helpful": [1, 2], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I am so impresed with Samsung, this is my second small TV from them.CONS Does not automatically adjust to the screen size input. There is a manual control which works fine, but needs setting.", "overall": 5.0, "summary": "Whats not to like", "unixReviewTime": 1383004800, "reviewTime": "10 29, 2013"}
{"reviewerID": "A5978Z6XMV3TI", "asin": "B00BCGRZ04", "reviewerName": "Point Man \"It's a long way to the top, if you...", "helpful": [2, 5], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I'm old enough to remember when computers were huge machines, and TV screens were 60&#34; wide or even larger!  Now through the miracle of miniaturization, you can get a great television set which measures only 19&#34; across!!  I am delighted, but wonder if I had waited another year or so, could have gotten one even smaller.", "overall": 5.0, "summary": "The miracle of miniturization", "unixReviewTime": 1375833600, "reviewTime": "08 7, 2013"}
{"reviewerID": "A25SACMUXM5X0T", "asin": "B00BCGRZ04", "reviewerName": "RAF", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Excellent HD picture for our kitchen counter.  Although not quite as clear as the much larger 32 and 40 inch LED's elsewhere in the house, this works well under our kitchen cabinets.", "overall": 5.0, "summary": "If you want a small flatscreen LED TV, this is great!", "unixReviewTime": 1378080000, "reviewTime": "09 2, 2013"}
{"reviewerID": "A1C73RRUMRZIHS", "asin": "B00BCGRZ04", "reviewerName": "Randy \"rschamberg2\"", "helpful": [2, 2], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I needed an LED TV to replace my aged (1997)  27&#34; table mounted TV because of space limitations.  This TV fit perfectly up in the corner between a closet and a window.  The TV was easy to set up and the picture quality is great. I bought this TV because I am a long-time Samsung user and I have been very pleased with all the Samsung products I have (cameras, refrigerator, mp4 player, etc).", "overall": 5.0, "summary": "Perfect for my bedroom corner wall mount", "unixReviewTime": 1376956800, "reviewTime": "08 20, 2013"}
{"reviewerID": "A2RJK4198RFSI9", "asin": "B00BCGRZ04", "reviewerName": "Ranger \"Happy Retiree\"", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Easy to set up and program.  I'm very happy with it.  Excellent picture quality.  I think anything Samsung is excellent.  Have a Samung camera that is awesome, taking pictures and videos.  There is one little annoyance.  When turning the TV on or off, there is a little musical sound, sort of like when Windows starts on a computer.  Perhaps there is a way to turn it off that I don't know about.  Never-the-less, a five star product.", "overall": 5.0, "summary": "Nice small TV for kitchen counter or desktop", "unixReviewTime": 1390521600, "reviewTime": "01 24, 2014"}
{"reviewerID": "AHZ0OA3U26THX", "asin": "B00BCGRZ04", "reviewerName": "Rich", "helpful": [1, 2], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I use this as an extra laptop dual monitor. It is not as clear as the one on my laptop but it is adequate. I lost the remote and I do not know how to turn it off. It powers off by itself from lack of use,", "overall": 3.0, "summary": "Good moniter", "unixReviewTime": 1392076800, "reviewTime": "02 11, 2014"}
{"reviewerID": "AA8RBTN3J2F5H", "asin": "B00BCGRZ04", "reviewerName": "R. Kent McVety", "helpful": [2, 2], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I run video in our church, and while we have expensive equipment, the monitor in the control booth is poor quality.  It is difficult to tell if the camera exposure is correct using this poor quality TV.  When I play recordings at home afterward, the picture looks different from when viewing it live.  I was looking for a TV to use as a monitor that would match the picture on my JVC professional CRT monitor.  I spent several hours adjusting the settings, and finally got a very close match to my professional monitor.  The factory settings look awful, so adjustments are necessary to get a really good picture.  Like other reviews, I found the stand to be flimsy, and difficult to get the screws tight enough.  By doing some hard turning of the screw driver, I was able to get the stand tightly fastened. The stand has a nice glossy finish, but is not as strong as the one on my older Samsung TV.  It seems that as the TVs become lighter in weight, the stands are also lighter.  Here are the settings I used.  They worked for me.  The TV was on a small table that was slightly lower than my line of sight.  My settings were based upon this angle..Mode:  StandardMagic Angle : Standing ModeBack Light : 20Contrast : 95Brightness : 52 (for component and HDMI, 65 for composite)Sharpness : 50Color : 40 (for component, 38 for HDMI, 44 for composite)Tint : (G/R)  G40/R60Dynamic Contract : OffBlack Tone : OffFlesh Tone : -2Color Space : NativeWhite Balance : No changeGamma : 0Motion Lighting : OffColor Tone : StandardSize: 4:3 (using TV for SD video)Digital Clean View : OffMPEG Noise Filter : AutoLED Clear Motion : OffHDMI Black Level : Normal (works only for adjusting HDMI mode)I found the Magic Angle to be a big help.  With this turned off, the picture looked washed out.  These settings did work for me. However, they may not be ideal for everyone.", "overall": 5.0, "summary": "Matches my professional monitor", "unixReviewTime": 1389225600, "reviewTime": "01 9, 2014"}
{"reviewerID": "A2N2W0VNLBVJ3E", "asin": "B00BCGRZ04", "reviewerName": "Ronald E. Martin \"Plumb Cheap\"", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Just got this from Amazon a few days ago. Nice picture and audio is good. There are not that many choices for 19&#34; models. I think this one is probably as good as it gets.", "overall": 5.0, "summary": "Just the right size for a kitchen.", "unixReviewTime": 1393718400, "reviewTime": "03 2, 2014"}
{"reviewerID": "A2B420CB0KROU1", "asin": "B00BCGRZ04", "reviewerName": "Seattleite", "helpful": [2, 3], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "We're using this in our kitchen and it is great for this purpose.  It is low enough to fit under cabinets but screen is large enough to watch from across the room and sound quality  is very good.  Lots of controls for picture settings, picture quality is also very good.  It was harder than expected to screw the base to the TV but once the screws are firmly seated the stand is sturdy enough.  No regrets on this purchase!", "overall": 5.0, "summary": "Great value for small tv", "unixReviewTime": 1371340800, "reviewTime": "06 16, 2013"}
{"reviewerID": "A2EDWI5EGP4V9N", "asin": "B00BCGRZ04", "reviewerName": "sharkychick", "helpful": [3, 3], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I purchased two of these in the 19-inch size to replace the two 15-inch Toshibas I had in my kitchen and on my desk.  Our cable co is going to boxes only - no more through the wall cable, only cable through boxes starting in February.  Got the boxes and decided I needed to replace mine (although they are great little TVs) with something that has HDMI ports.So, I am extremely pleased with the picture and the sound for these TVs.  Without the HDMI it was ok, but since the cable box has HDMI (and I guess they have gone to all HD now, as long as you have the cables - woo hoo!) I figured I'd do better using that, over the a/v cables, so I got a couple of the Amazon Basics HDMI cables (great cables - I use them all over my house!) and made myself a better hook up for both of these little TVs.  It's stunning.The TV's menu has a lot of picture, sound, etc, choices.  It seems like a really good little remote, so I'm kind of sad I have to use those big, clunky, Charter remotes.Fortunately, I read several reviews and one thing that seemed to be apparent was that attaching the stand could be problematic.  I did what one reviewer recommended and screwed the screws into the television first.  Then  I took them out and attached the stand, screwing it in.  Having done that it was pretty easy.  I did it on my own, without anybody else to help.  I've attached the stands for all the TVs in my house, so I was fairly familiar with the process.  I just lay the TV, face down, on a soft towel on my dining room table - with the bottom end at the edge of the table.  That makes it pretty easy to get the stand on.  Then I get one of the screws in about three quarters of the way so that I have stability and then do the rest, and tighten everything up.So, the reason I gave it only four stars is that the stand for this TV is slightly sub-standard.  The stands on my 15-inch Toshibas were way wider and more stable.  I'd be sure that this TV is not where kids or animals can access it because I feel like you could knock it over with a feather.  It's not a deal-breaker because it will be ok but I wish the stand were wider.", "overall": 4.0, "summary": "Beautiful picture - big sound!", "unixReviewTime": 1391126400, "reviewTime": "01 31, 2014"}
{"reviewerID": "A2Q4PJ7XWBEX4G", "asin": "B00BCGRZ04", "reviewerName": "The Jersey Family", "helpful": [1, 2], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I bought this tv to install in my master bathroom so I can watch the news in the morning when I am getting ready for work.  We were doing a bathroom remodel and decided this was the perfect time to install it on the wall.  Perfect size for what I needed.  Great picture and sound as well.", "overall": 5.0, "summary": "Nice compact tv with a great picture.", "unixReviewTime": 1374883200, "reviewTime": "07 27, 2013"}
{"reviewerID": "A3RM4WTQL8VAU5", "asin": "B00BCGRZ04", "reviewerName": "tired of bats", "helpful": [280, 288], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I bought this tv for an exercise room and hoped the speaker volume would be enough to overcome the treadmill noise. Not only was it loud enough but the tv has a setting in the sound menu called Clear Voice that emphasizes voice over sounds. This makes it much easier to understand what people are saying while on the treadmill. It also has a setting called Auto Volume that automatically adjusts the volume to the same level on all channels.I am using the tv with a small roof top antenna and it gets all the stations from a 56 mile distance. I compared this tv's channel reception to my more expensive Toshiba Regza 46XV645U and they were both the same, so my worries of a cheap tv having an inferior tuner were over.The base of the tv is not adjustable but was quite sturdy and level. The back has a 75mm by 75mm vesa mount so it could be mounted with something like this mount:Cheetah Mounts ALAMB Articulating Arm TV Wall Mount Bracket for VESA 100 12-24\" LCD LED Flat Screen Monitors Display/TVs up to 40lbs Includes Free 10' HDMI Cable and 6\" Bubble LevelI mounted this tv up high and used a feature in the picture menu called Samsung Magic Angle. This has settings to adjust the picture quality to compensate for the tv not being close to level line of sight. This brought the picture back to the same quality as if I were looking at it straight on. This feature could also be used if the tv were mounted real low.The quality, picture, and sound of this tv were above my expectations for a tv at this price.Update:After 1 year the tv is still going strong with no issues. I am very happy with this purchase.", "overall": 5.0, "summary": "great tv with some excellent features", "unixReviewTime": 1369612800, "reviewTime": "05 27, 2013"}
{"reviewerID": "A3I38VP7ZNCKM9", "asin": "B00BCGRZ04", "reviewerName": "T. JORGENSON \"Pamphleteer\"", "helpful": [2, 5], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Great unit, no drawbacks, THIN with a very good picture...it's a winner for the price.I do wish the remote had a light...I'd been happy to have paid another five bucks for a remote I could see in the dark.  Beyond that preference, no complaints, it's a greatvTV.", "overall": 5.0, "summary": "ABSOLUTELY SATISFIED", "unixReviewTime": 1381795200, "reviewTime": "10 15, 2013"}
{"reviewerID": "A2FTM0JFU230EH", "asin": "B00BCGRZ04", "reviewerName": "Tom \"I am a 79 year old retired business man....", "helpful": [0, 0], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "...and typically great Samsung quality and performance.  No, I didn't get paid to say that. :)  Installed the TV as a monitor on a new build computer setup and it works just like I had hoped.  Beats the price of a similar size monitor all to pieces and at that size and viewing distance the dpi make little difference, unless you are one of those &#34;picky&#34; users.  Very satisfied, in case you can't tell.", "overall": 5.0, "summary": "Typically great Amazon service...", "unixReviewTime": 1400025600, "reviewTime": "05 14, 2014"}
{"reviewerID": "AM5FWHRUN3UPH", "asin": "B00BCGRZ04", "reviewerName": "VQT", "helpful": [3, 5], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "I needed to mount a slim LED in my bedroom but the wall between 2 windows where I want it wouldn't accommodate a 32\" TV.This odd 29\" size fit perfectly in the spot.  You can't imagine how difficult it was to find an odd ball size like this but beyond the size, Samsung's LED quality & reputation sold me on this set.The picture is as expected for a light duty, bedroom LED - which is to say, it's teflon, & crisp but not life like like a plasma.But as it used mostly for falling to sleep to & about 30-45 minutes a day, the sizing & price is what really makes this set a winner in my eyes.", "overall": 5.0, "summary": "Odd 29\" Size sold me, performance to price - Made me write review!", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}
{"reviewerID": "A3QP04X19LNKNR", "asin": "B00BCGRZ04", "reviewerName": "W. Johnson", "helpful": [3, 3], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "Awesome little TV that I use in my kitchen.  I love everything except that it only has no buttons to control channels, volume, no/off.  Instead, it has a joystick in the back of the TV (lower left corner).  You have to push it to bring up a menu and then move it in one of four directions to do what you want using the pop up menu on the screen.  Would be much more convenient if it had simply buttons on the front like most TVs.", "overall": 4.0, "summary": "Almost perfect", "unixReviewTime": 1386633600, "reviewTime": "12 10, 2013"}
{"reviewerID": "A2SVOHSA3GOHBY", "asin": "B00BCGRZ04", "reviewerName": "Yolanda Saez \"YOLANDA SAEZ\"", "helpful": [1, 1], "title": "Samsung UN19F4000 19-Inch 720p 60Hz Slim LED HDTV", "reviewText": "my grandson simply loves hisnew tv n i cant seem to get him off it thanks i will recament this product", "overall": 5.0, "summary": "love it", "unixReviewTime": 1404172800, "reviewTime": "07 1, 2014"}